iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res12[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSPACT:1;
      uint64_t USER:1;
      uint64_t reservedSpace0:1;
      uint64_t THREAD:1;
      uint64_t HFRDY:1;
      uint64_t MMRDY:1;
      uint64_t BFRDY:1;
      uint64_t reservedSpace1:1;
      uint64_t MONRDY:1;
      uint64_t reservedSpace2:21;
      uint64_t LSPEN:1;
      uint64_t ASPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t ADDRESS:29;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPCAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:22;
      uint64_t RMode:2;
      uint64_t FZ:1;
      uint64_t DN:1;
      uint64_t AHP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPDSCR;

};

#define PPB (*(volatile struct PPB_tag *) 0xe000e008)

struct DLR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LN0:1;
      uint64_t LN1:1;
      uint64_t LN2:1;
      uint64_t LN3:1;
      uint64_t LN4:1;
      uint64_t LN5:1;
      uint64_t LN6:1;
      uint64_t LN7:1;
      uint64_t LN8:1;
      uint64_t LN9:1;
      uint64_t LN10:1;
      uint64_t LN11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LN0:1;
      uint64_t LN1:1;
      uint64_t LN2:1;
      uint64_t LN3:1;
      uint64_t LN4:1;
      uint64_t LN5:1;
      uint64_t LN6:1;
      uint64_t LN7:1;
      uint64_t LN8:1;
      uint64_t LN9:1;
      uint64_t LN10:1;
      uint64_t LN11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OVRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS0:4;
      uint64_t RS1:4;
      uint64_t RS2:4;
      uint64_t RS3:4;
      uint64_t RS4:4;
      uint64_t RS5:4;
      uint64_t RS6:4;
      uint64_t RS7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RS8:4;
      uint64_t RS9:4;
      uint64_t RS10:4;
      uint64_t RS11:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LN0:1;
      uint64_t LN1:1;
      uint64_t LN2:1;
      uint64_t LN3:1;
      uint64_t LN4:1;
      uint64_t LN5:1;
      uint64_t LN6:1;
      uint64_t LN7:1;
      uint64_t LN8:1;
      uint64_t LN9:1;
      uint64_t LN10:1;
      uint64_t LN11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LNEN;

};

#define DLR (*(volatile struct DLR_tag *) 0x50004900)

struct ERU0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXS0A:2;
      uint64_t EXS0B:2;
      uint64_t EXS1A:2;
      uint64_t EXS1B:2;
      uint64_t EXS2A:2;
      uint64_t EXS2B:2;
      uint64_t EXS3A:2;
      uint64_t EXS3B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXISEL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_3;

};

#define ERU0 (*(volatile struct ERU0_tag *) 0x50004800)

struct ERU1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXS0A:2;
      uint64_t EXS0B:2;
      uint64_t EXS1A:2;
      uint64_t EXS1B:2;
      uint64_t EXS2A:2;
      uint64_t EXS2B:2;
      uint64_t EXS3A:2;
      uint64_t EXS3B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXISEL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_3;

