iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define ERU1 (*(volatile struct ERU1_tag *) 0x40044000)

struct GPDMA0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWTFR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWBLOCK;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWSRCTRAN;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWDSTTRAN;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWERR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSTFR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSBLOCK;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSSRCTRAN;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSDSTTRAN;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSERR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKTFR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKBLOCK;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKSRCTRAN;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKDSTTRAN;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKERR;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARTFR;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARBLOCK;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARSRCTRAN;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARDSTTRAN;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARERR;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFR:1;
      uint64_t BLOCK:1;
      uint64_t SRCT:1;
      uint64_t DSTT:1;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSINT;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQSRCREG;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQDSTREG;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGLREQSRCREG;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGLREQDSTREG;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LSTSRCREG;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
      uint64_t WE_CH4:1;
      uint64_t WE_CH5:1;
      uint64_t WE_CH6:1;
      uint64_t WE_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LSTDSTREG;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACFGREG;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:8;
      uint64_t WE_CH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHENREG;

