iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res29[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

};

#define GPDMA0 (*(volatile struct GPDMA0_tag *) 0x500142c0)

struct GPDMA0_CH0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOC:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LLP;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t SRC_GATHER_EN:1;
      uint64_t DST_SCATTER_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TT_FC:3;
      uint64_t reservedSpace1:4;
      uint64_t LLP_DST_EN:1;
      uint64_t LLP_SRC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTAT;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTATAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTATAR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTATAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTATAR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
      uint64_t RELOAD_SRC:1;
      uint64_t RELOAD_DST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t DS_UPD_EN:1;
      uint64_t SS_UPD_EN:1;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SGI:20;
      uint64_t SGC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI:20;
      uint64_t DSC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSR;

};

#define GPDMA0_CH0 (*(volatile struct GPDMA0_CH0_tag *) 0x50014000)

struct GPDMA0_CH1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOC:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LLP;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t SRC_GATHER_EN:1;
      uint64_t DST_SCATTER_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TT_FC:3;
      uint64_t reservedSpace1:4;
      uint64_t LLP_DST_EN:1;
      uint64_t LLP_SRC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTAT;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTAT;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTATAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSTATAR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTATAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSTATAR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
      uint64_t RELOAD_SRC:1;
      uint64_t RELOAD_DST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t DS_UPD_EN:1;
      uint64_t SS_UPD_EN:1;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SGI:20;
      uint64_t SGC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGR;

