iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI:20;
      uint64_t DSC:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSR;

};

#define GPDMA0_CH1 (*(volatile struct GPDMA0_CH1_tag *) 0x50014058)

struct GPDMA0_CH2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

};

#define GPDMA0_CH2 (*(volatile struct GPDMA0_CH2_tag *) 0x500140b0)

struct GPDMA0_CH3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

};

#define GPDMA0_CH3 (*(volatile struct GPDMA0_CH3_tag *) 0x50014108)

struct GPDMA0_CH4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

};

#define GPDMA0_CH4 (*(volatile struct GPDMA0_CH4_tag *) 0x50014160)

struct GPDMA0_CH5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

