iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define GPDMA0_CH5 (*(volatile struct GPDMA0_CH5_tag *) 0x500141b8)

struct GPDMA0_CH6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

};

#define GPDMA0_CH6 (*(volatile struct GPDMA0_CH6_tag *) 0x50014210)

struct GPDMA0_CH7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SAR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
      uint64_t DST_TR_WIDTH:3;
      uint64_t SRC_TR_WIDTH:3;
      uint64_t DINC:2;
      uint64_t SINC:2;
      uint64_t DEST_MSIZE:3;
      uint64_t SRC_MSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t TT_FC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK_TS:12;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTLH;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CH_PRIOR:3;
      uint64_t CH_SUSP:1;
      uint64_t FIFO_EMPTY:1;
      uint64_t HS_SEL_DST:1;
      uint64_t HS_SEL_SRC:1;
      uint64_t LOCK_CH_L:2;
      uint64_t LOCK_B_L:2;
      uint64_t LOCK_CH:1;
      uint64_t LOCK_B:1;
      uint64_t DST_HS_POL:1;
      uint64_t SRC_HS_POL:1;
      uint64_t MAX_ABRST:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCMODE:1;
      uint64_t FIFO_MODE:1;
      uint64_t PROTCTL:3;
      uint64_t reservedSpace0:2;
      uint64_t SRC_PER:4;
      uint64_t DEST_PER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGH;

};

#define GPDMA0_CH7 (*(volatile struct GPDMA0_CH7_tag *) 0x50014268)

struct GPDMA1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWTFR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWBLOCK;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWSRCTRAN;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWDSTTRAN;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWERR;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSTFR;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSBLOCK;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSSRCTRAN;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSDSTTRAN;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSERR;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKTFR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKBLOCK;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKSRCTRAN;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKDSTTRAN;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MASKERR;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARTFR;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARBLOCK;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARSRCTRAN;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARDSTTRAN;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARERR;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFR:1;
      uint64_t BLOCK:1;
      uint64_t SRCT:1;
      uint64_t DSTT:1;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUSINT;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQSRCREG;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQDSTREG;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGLREQSRCREG;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SGLREQDSTREG;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LSTSRCREG;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH0:1;
      uint64_t WE_CH1:1;
      uint64_t WE_CH2:1;
      uint64_t WE_CH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LSTDSTREG;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACFGREG;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:4;
      uint64_t reservedSpace0:4;
      uint64_t WE_CH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHENREG;

