iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define GPDMA1_CH3 (*(volatile struct GPDMA1_CH3_tag *) 0x50018108)

struct FCE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define FCE (*(volatile struct FCE_tag *) 0x50020000)

struct FCE_KE0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMI:1;
      uint64_t CEI:1;
      uint64_t LEI:1;
      uint64_t BEI:1;
      uint64_t CCE:1;
      uint64_t ALR:1;
      uint64_t reservedSpace0:2;
      uint64_t REFIN:1;
      uint64_t REFOUT:1;
      uint64_t XSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMF:1;
      uint64_t CEF:1;
      uint64_t LEF:1;
      uint64_t BEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHECK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHECK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCM:1;
      uint64_t FRM_CFG:1;
      uint64_t FRM_CHECK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

};

#define FCE_KE0 (*(volatile struct FCE_KE0_tag *) 0x50020020)

struct FCE_KE1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMI:1;
      uint64_t CEI:1;
      uint64_t LEI:1;
      uint64_t BEI:1;
      uint64_t CCE:1;
      uint64_t ALR:1;
      uint64_t reservedSpace0:2;
      uint64_t REFIN:1;
      uint64_t REFOUT:1;
      uint64_t XSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMF:1;
      uint64_t CEF:1;
      uint64_t LEF:1;
      uint64_t BEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHECK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHECK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCM:1;
      uint64_t FRM_CFG:1;
      uint64_t FRM_CHECK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

};

#define FCE_KE1 (*(volatile struct FCE_KE1_tag *) 0x50020040)

struct FCE_KE2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMI:1;
      uint64_t CEI:1;
      uint64_t LEI:1;
      uint64_t BEI:1;
      uint64_t CCE:1;
      uint64_t ALR:1;
      uint64_t reservedSpace0:2;
      uint64_t REFIN:1;
      uint64_t REFOUT:1;
      uint64_t XSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMF:1;
      uint64_t CEF:1;
      uint64_t LEF:1;
      uint64_t BEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHECK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHECK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCM:1;
      uint64_t FRM_CFG:1;
      uint64_t FRM_CHECK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

};

#define FCE_KE2 (*(volatile struct FCE_KE2_tag *) 0x50020060)

struct FCE_KE3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMI:1;
      uint64_t CEI:1;
      uint64_t LEI:1;
      uint64_t BEI:1;
      uint64_t CCE:1;
      uint64_t ALR:1;
      uint64_t reservedSpace0:2;
      uint64_t REFIN:1;
      uint64_t REFOUT:1;
      uint64_t XSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMF:1;
      uint64_t CEF:1;
      uint64_t LEF:1;
      uint64_t BEF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LENGTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LENGTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHECK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHECK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCM:1;
      uint64_t FRM_CFG:1;
      uint64_t FRM_CHECK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

