iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define FCE_KE3 (*(volatile struct FCE_KE3_tag *) 0x50020080)

struct PBA0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WADDR;

};

#define PBA0 (*(volatile struct PBA0_tag *) 0x40000000)

struct PBA1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WADDR;

};

#define PBA1 (*(volatile struct PBA1_tag *) 0x48000000)

struct FLASH0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBUSY:1;
      uint64_t FABUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t PROG:1;
      uint64_t ERASE:1;
      uint64_t PFPAGE:1;
      uint64_t reservedSpace1:1;
      uint64_t PFOPER:1;
      uint64_t reservedSpace2:1;
      uint64_t SQER:1;
      uint64_t PROER:1;
      uint64_t PFSBER:1;
      uint64_t reservedSpace3:1;
      uint64_t PFDBER:1;
      uint64_t reservedSpace4:1;
      uint64_t PROIN:1;
      uint64_t reservedSpace5:1;
      uint64_t RPROIN:1;
      uint64_t RPRODIS:1;
      uint64_t reservedSpace6:1;
      uint64_t WPROIN0:1;
      uint64_t WPROIN1:1;
      uint64_t WPROIN2:1;
      uint64_t reservedSpace7:1;
      uint64_t WPRODIS0:1;
      uint64_t WPRODIS1:1;
      uint64_t reservedSpace8:1;
      uint64_t SLM:1;
      uint64_t reservedSpace9:2;
      uint64_t VER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSPFLASH:4;
      uint64_t WSECPF:1;
      uint64_t reservedSpace0:8;
      uint64_t IDLE:1;
      uint64_t ESLDIS:1;
      uint64_t SLEEP:1;
      uint64_t RPA:1;
      uint64_t DCF:1;
      uint64_t DDF:1;
      uint64_t reservedSpace1:5;
      uint64_t VOPERM:1;
      uint64_t SQERM:1;
      uint64_t PROERM:1;
      uint64_t PFSBERM:1;
      uint64_t reservedSpace2:1;
      uint64_t PFDBERM:1;
      uint64_t reservedSpace3:1;
      uint64_t EOBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MARGIN:4;
      uint64_t reservedSpace0:11;
      uint64_t TRAPDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MARP;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0L:1;
      uint64_t S1L:1;
      uint64_t S2L:1;
      uint64_t S3L:1;
      uint64_t S4L:1;
      uint64_t S5L:1;
      uint64_t S6L:1;
      uint64_t S7L:1;
      uint64_t S8L:1;
      uint64_t S9L:1;
      uint64_t S10_S11L:1;
      uint64_t S12_S13L:1;
      uint64_t S14_S15L:1;
      uint64_t reservedSpace0:2;
      uint64_t RPRO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROCON0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0L:1;
      uint64_t S1L:1;
      uint64_t S2L:1;
      uint64_t S3L:1;
      uint64_t S4L:1;
      uint64_t S5L:1;
      uint64_t S6L:1;
      uint64_t S7L:1;
      uint64_t S8L:1;
      uint64_t S9L:1;
      uint64_t S10_S11L:1;
      uint64_t S12_S13L:1;
      uint64_t S14_S15L:1;
      uint64_t reservedSpace0:3;
      uint64_t PSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROCON1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0ROM:1;
      uint64_t S1ROM:1;
      uint64_t S2ROM:1;
      uint64_t S3ROM:1;
      uint64_t S4ROM:1;
      uint64_t S5ROM:1;
      uint64_t S6ROM:1;
      uint64_t S7ROM:1;
      uint64_t S8ROM:1;
      uint64_t S9ROM:1;
      uint64_t S10_S11ROM:1;
      uint64_t S12_S13ROM:1;
      uint64_t S14_S15ROM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROCON2;

};

#define FLASH0 (*(volatile struct FLASH0_tag *) 0x58002008)

struct PREF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBYP:1;
      uint64_t IINV:1;
      uint64_t reservedSpace0:2;
      uint64_t DBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCON;

};

#define PREF (*(volatile struct PREF_tag *) 0x58004000)

struct PMU0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define PMU0 (*(volatile struct PMU0_tag *) 0x58000508)

struct WDT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENB:1;
      uint64_t PRE:1;
      uint64_t reservedSpace0:2;
      uint64_t DSP:1;
      uint64_t reservedSpace1:3;
      uint64_t SPW:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WLB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLR;

