iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define WDT (*(volatile struct WDT_tag *) 0x50008000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENB:1;
      uint64_t reservedSpace0:1;
      uint64_t TAE:1;
      uint64_t reservedSpace1:5;
      uint64_t ESEC:1;
      uint64_t EMIC:1;
      uint64_t EHOC:1;
      uint64_t EDAC:1;
      uint64_t reservedSpace2:1;
      uint64_t EMOC:1;
      uint64_t EYEC:1;
      uint64_t reservedSpace3:1;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPSE:1;
      uint64_t RPMI:1;
      uint64_t RPHO:1;
      uint64_t RPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t RPMO:1;
      uint64_t RPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t RAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPSE:1;
      uint64_t SPMI:1;
      uint64_t SPHO:1;
      uint64_t SPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t SPMO:1;
      uint64_t SPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t SAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSE:1;
      uint64_t MPMI:1;
      uint64_t MPHO:1;
      uint64_t MPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t MPMO:1;
      uint64_t MPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t MAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSKSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPSE:1;
      uint64_t RPMI:1;
      uint64_t RPHO:1;
      uint64_t RPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t RPMO:1;
      uint64_t RPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t RAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASE:6;
      uint64_t reservedSpace0:2;
      uint64_t AMI:6;
      uint64_t reservedSpace1:2;
      uint64_t AHO:5;
      uint64_t reservedSpace2:3;
      uint64_t ADA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t AMO:4;
      uint64_t reservedSpace1:4;
      uint64_t AYE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SE:6;
      uint64_t reservedSpace0:2;
      uint64_t MI:6;
      uint64_t reservedSpace1:2;
      uint64_t HO:5;
      uint64_t reservedSpace2:3;
      uint64_t DA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAWE:3;
      uint64_t reservedSpace0:5;
      uint64_t MO:4;
      uint64_t reservedSpace1:4;
      uint64_t YE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM1;

};

#define RTC (*(volatile struct RTC_tag *) 0x50004a00)

struct SCU_CLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCST:1;
      uint64_t MMCCST:1;
      uint64_t ETH0CST:1;
      uint64_t EBUCST:1;
      uint64_t CCUCST:1;
      uint64_t WDTCST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCEN:1;
      uint64_t MMCCEN:1;
      uint64_t ETH0CEN:1;
      uint64_t EBUCEN:1;
      uint64_t CCUCEN:1;
      uint64_t WDTCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCDI:1;
      uint64_t MMCCDI:1;
      uint64_t ETH0CDI:1;
      uint64_t EBUCDI:1;
      uint64_t CCUCDI:1;
      uint64_t WDTCDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSDIV:8;
      uint64_t reservedSpace0:8;
      uint64_t SYSSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPUDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBDIV:3;
      uint64_t reservedSpace0:13;
      uint64_t USBSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EBUDIV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EBUCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCUDIV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCUCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTDIV:8;
      uint64_t reservedSpace0:8;
      uint64_t WDTSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECKSEL:2;
      uint64_t reservedSpace0:14;
      uint64_t ECKDIV:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXTCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSDIV:8;
      uint64_t SYSSEL:1;
      uint64_t reservedSpace0:1;
      uint64_t CPUDIV:1;
      uint64_t reservedSpace1:1;
      uint64_t PBDIV:1;
      uint64_t reservedSpace2:1;
      uint64_t CCUDIV:1;
      uint64_t reservedSpace3:1;
      uint64_t WDTDIV:8;
      uint64_t WDTSEL:2;
      uint64_t EBUDIV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MLINKCLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSSEL:1;
      uint64_t reservedSpace0:15;
      uint64_t USBCR:1;
      uint64_t MMCCR:1;
      uint64_t ETH0CR:1;
      uint64_t EBUCR:1;
      uint64_t CCUCR:1;
      uint64_t WDTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLEEPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSSEL:2;
      uint64_t reservedSpace0:9;
      uint64_t FPDN:1;
      uint64_t PLLPDN:1;
      uint64_t VCOPDN:1;
      uint64_t reservedSpace1:2;
      uint64_t USBCR:1;
      uint64_t MMCCR:1;
      uint64_t ETH0CR:1;
      uint64_t EBUCR:1;
      uint64_t CCUCR:1;
      uint64_t WDTCR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSLEEPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECADIV:2;
      uint64_t reservedSpace0:14;
      uint64_t ECATSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECATCLKCR;

