iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t DSD_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t CCU42_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU81_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t DSD_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t CCU42_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU81_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t DSD_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t CCU42_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU81_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0:1;
      uint64_t MCAN0:1;
      uint64_t DAC_bitfield:1;
      uint64_t MMCI:1;
      uint64_t USIC1_bitfield:1;
      uint64_t USIC2_bitfield:1;
      uint64_t PPORTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0:1;
      uint64_t MCAN0:1;
      uint64_t DAC_bitfield:1;
      uint64_t MMCI:1;
      uint64_t USIC1_bitfield:1;
      uint64_t USIC2_bitfield:1;
      uint64_t PPORTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43_bitfield:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0:1;
      uint64_t MCAN0:1;
      uint64_t DAC_bitfield:1;
      uint64_t MMCI:1;
      uint64_t USIC1_bitfield:1;
      uint64_t USIC2_bitfield:1;
      uint64_t PPORTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDT_bitfield:1;
      uint64_t ETH0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t FCE_bitfield:1;
      uint64_t USB:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSTAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDT_bitfield:1;
      uint64_t ETH0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t FCE_bitfield:1;
      uint64_t USB:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDT_bitfield:1;
      uint64_t ETH0_bitfield:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0:1;
      uint64_t DMA1:1;
      uint64_t FCE_bitfield:1;
      uint64_t USB:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATCLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBU_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSTAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBU_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSET3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBU_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATCLR3;

};

#define SCU_CLK (*(volatile struct SCU_CLK_tag *) 0x50004600)

struct SCU_OSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t X1D:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCHPSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t X1DEN:1;
      uint64_t SHBY:1;
      uint64_t GAINSEL:2;
      uint64_t MODE:2;
      uint64_t reservedSpace0:10;
      uint64_t OSCVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCHPCTRL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALIBCONST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCALCONST;

};

#define SCU_OSC (*(volatile struct SCU_OSC_tag *) 0x50004700)

struct SCU_PLL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCOBYST:1;
      uint64_t PWDSTAT:1;
      uint64_t VCOLOCK:1;
      uint64_t reservedSpace0:1;
      uint64_t K1RDY:1;
      uint64_t K2RDY:1;
      uint64_t BY:1;
      uint64_t PLLLV:1;
      uint64_t PLLHV:1;
      uint64_t PLLSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCOBYP:1;
      uint64_t VCOPWD:1;
      uint64_t VCOTR:1;
      uint64_t reservedSpace0:1;
      uint64_t FINDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCDISCDIS:1;
      uint64_t reservedSpace2:9;
      uint64_t PLLPWD:1;
      uint64_t OSCRES:1;
      uint64_t RESLD:1;
      uint64_t AOTREN:1;
      uint64_t FOTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCON0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t K1DIV:7;
      uint64_t reservedSpace0:1;
      uint64_t NDIV:7;
      uint64_t reservedSpace1:1;
      uint64_t K2DIV:7;
      uint64_t reservedSpace2:1;
      uint64_t PDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCON1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSEL:1;
      uint64_t reservedSpace0:7;
      uint64_t K1INSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCON2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCOBYST:1;
      uint64_t PWDSTAT:1;
      uint64_t VCOLOCK:1;
      uint64_t reservedSpace0:3;
      uint64_t BY:1;
      uint64_t VCOLOCKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCOBYP:1;
      uint64_t VCOPWD:1;
      uint64_t VCOTR:1;
      uint64_t reservedSpace0:1;
      uint64_t FINDIS:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCDISCDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t NDIV:7;
      uint64_t reservedSpace3:1;
      uint64_t PLLPWD:1;
      uint64_t reservedSpace4:1;
      uint64_t RESLD:1;
      uint64_t reservedSpace5:5;
      uint64_t PDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USBPLLCON;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLKMUX:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKMXSTAT;

