iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define SCU_PLL (*(volatile struct SCU_PLL_tag *) 0x50004710)

struct SCU_GENERAL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDCHIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCHIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEPT:5;
      uint64_t MANUF:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDMANUF;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWCON:2;
      uint64_t reservedSpace0:6;
      uint64_t SWCON:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STCON;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPR1;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GSC40:1;
      uint64_t GSC41:1;
      uint64_t GSC42:1;
      uint64_t GSC43:1;
      uint64_t reservedSpace0:4;
      uint64_t GSC80:1;
      uint64_t GSC81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCUCON;

  uint8_t res3[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:1;
      uint64_t START:1;
      uint64_t reservedSpace0:2;
      uint64_t OFFSET:7;
      uint64_t GAIN:6;
      uint64_t REFTRIM:3;
      uint64_t BGTRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTSCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:10;
      uint64_t reservedSpace0:4;
      uint64_t RDY:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTSSTAT;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TAPDEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMCDEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ENORC6:1;
      uint64_t ENORC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) G0ORCEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t ENORC6:1;
      uint64_t ENORC7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) G1ORCEN;

  uint8_t res5[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HDCLR:1;
      uint64_t HDSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
      uint64_t RTC_MSKSR:1;
      uint64_t RTC_CLRSR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIRRSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDWR:1;
      uint64_t reservedSpace0:15;
      uint64_t ADDR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMDATA;

};

#define SCU_GENERAL (*(volatile struct SCU_GENERAL_tag *) 0x50004000)

struct SCU_INTERRUPT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t DLROVR:1;
      uint64_t reservedSpace0:12;
      uint64_t HDSTAT:1;
      uint64_t HDCLR:1;
      uint64_t HDSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t DLROVR:1;
      uint64_t reservedSpace0:12;
      uint64_t HDSTAT:1;
      uint64_t HDCLR:1;
      uint64_t HDSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t DLROVR:1;
      uint64_t reservedSpace0:12;
      uint64_t HDSTAT:1;
      uint64_t HDCLR:1;
      uint64_t HDSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t DLROVR:1;
      uint64_t reservedSpace0:12;
      uint64_t HDSTAT:1;
      uint64_t HDCLR:1;
      uint64_t HDSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t DLROVR:1;
      uint64_t reservedSpace0:12;
      uint64_t HDSTAT:1;
      uint64_t HDCRCLR:1;
      uint64_t HDCRSET:1;
      uint64_t HDCR:1;
      uint64_t reservedSpace1:1;
      uint64_t OSCSICTRL:1;
      uint64_t OSCULSTAT:1;
      uint64_t OSCULCTRL:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t RMX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t reservedSpace0:13;
      uint64_t ERU00:1;
      uint64_t ERU01:1;
      uint64_t ERU02:1;
      uint64_t ERU03:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMIREQEN;

