iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define SCU_INTERRUPT (*(volatile struct SCU_INTERRUPT_tag *) 0x50004074)

struct SCU_PARITY_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEENPS:1;
      uint64_t PEENDS1:1;
      uint64_t PEENDS2:1;
      uint64_t reservedSpace0:5;
      uint64_t PEENU0:1;
      uint64_t PEENU1:1;
      uint64_t PEENU2:1;
      uint64_t reservedSpace1:1;
      uint64_t PEENMC:1;
      uint64_t PEENPPRF:1;
      uint64_t reservedSpace2:2;
      uint64_t PEENUSB:1;
      uint64_t PEENETH0TX:1;
      uint64_t PEENETH0RX:1;
      uint64_t PEENSD0:1;
      uint64_t PEENSD1:1;
      uint64_t reservedSpace3:3;
      uint64_t PEENECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELPS:1;
      uint64_t SELDS1:1;
      uint64_t SELDS2:1;
      uint64_t reservedSpace0:5;
      uint64_t USIC0DRA:1;
      uint64_t USIC1DRA:1;
      uint64_t USIC2DRA:1;
      uint64_t reservedSpace1:1;
      uint64_t MCANDRA:1;
      uint64_t PPRFDRA:1;
      uint64_t reservedSpace2:2;
      uint64_t SELUSB:1;
      uint64_t SELETH0TX:1;
      uint64_t SELETH0RX:1;
      uint64_t SELSD0:1;
      uint64_t SELSD1:1;
      uint64_t reservedSpace3:3;
      uint64_t SELECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCHKCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PETEPS:1;
      uint64_t PETEDS1:1;
      uint64_t PETEDS2:1;
      uint64_t reservedSpace0:5;
      uint64_t PETEU0:1;
      uint64_t PETEU1:1;
      uint64_t PETEU2:1;
      uint64_t reservedSpace1:1;
      uint64_t PETEMC:1;
      uint64_t PETEPPRF:1;
      uint64_t reservedSpace2:2;
      uint64_t PETEUSB:1;
      uint64_t PETEETH0TX:1;
      uint64_t PETEETH0RX:1;
      uint64_t PETESD0:1;
      uint64_t PETESD1:1;
      uint64_t reservedSpace3:3;
      uint64_t PETEECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PETE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERSTEN;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEFPS:1;
      uint64_t PEFDS1:1;
      uint64_t PEFDS2:1;
      uint64_t reservedSpace0:5;
      uint64_t PEFU0:1;
      uint64_t PEFU1:1;
      uint64_t PEFU2:1;
      uint64_t reservedSpace1:1;
      uint64_t PEFMC:1;
      uint64_t PEFPPRF:1;
      uint64_t reservedSpace2:2;
      uint64_t PEUSB:1;
      uint64_t PEETH0TX:1;
      uint64_t PEETH0RX:1;
      uint64_t PESD0:1;
      uint64_t PESD1:1;
      uint64_t reservedSpace3:3;
      uint64_t PEECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWR:8;
      uint64_t PRD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMTPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTENPS:1;
      uint64_t MTENDS1:1;
      uint64_t MTENDS2:1;
      uint64_t reservedSpace0:5;
      uint64_t MTEU0:1;
      uint64_t MTEU1:1;
      uint64_t MTEU2:1;
      uint64_t reservedSpace1:1;
      uint64_t MTEMC:1;
      uint64_t MTEPPRF:1;
      uint64_t reservedSpace2:2;
      uint64_t MTUSB:1;
      uint64_t MTETH0TX:1;
      uint64_t MTETH0RX:1;
      uint64_t MTSD0:1;
      uint64_t MTSD1:1;
      uint64_t reservedSpace3:3;
      uint64_t MTECAT0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMTSR;

};

#define SCU_PARITY (*(volatile struct SCU_PARITY_tag *) 0x5000413c)

struct SCU_TRAP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCWDGT:1;
      uint64_t reservedSpace0:1;
      uint64_t SVCOLCKT:1;
      uint64_t UVCOLCKT:1;
      uint64_t PET:1;
      uint64_t BRWNT:1;
      uint64_t ULPWDGT:1;
      uint64_t BWERR0T:1;
      uint64_t BWERR1T:1;
      uint64_t reservedSpace1:7;
      uint64_t ECAT0RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRAPSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCWDGT:1;
      uint64_t reservedSpace0:1;
      uint64_t SVCOLCKT:1;
      uint64_t UVCOLCKT:1;
      uint64_t PET:1;
      uint64_t BRWNT:1;
      uint64_t ULPWDGT:1;
      uint64_t BWERR0T:1;
      uint64_t BWERR1T:1;
      uint64_t reservedSpace1:7;
      uint64_t ECAT0RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRAPRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCWDGT:1;
      uint64_t reservedSpace0:1;
      uint64_t SVCOLCKT:1;
      uint64_t UVCOLCKT:1;
      uint64_t PET:1;
      uint64_t BRWNT:1;
      uint64_t ULPWDGT:1;
      uint64_t BWERR0T:1;
      uint64_t BWERR1T:1;
      uint64_t reservedSpace1:7;
      uint64_t ECAT0RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRAPDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCWDGT:1;
      uint64_t reservedSpace0:1;
      uint64_t SVCOLCKT:1;
      uint64_t UVCOLCKT:1;
      uint64_t PET:1;
      uint64_t BRWNT:1;
      uint64_t ULPWDGT:1;
      uint64_t BWERR0T:1;
      uint64_t BWERR1T:1;
      uint64_t reservedSpace1:7;
      uint64_t ECAT0RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRAPCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOSCWDGT:1;
      uint64_t reservedSpace0:1;
      uint64_t SVCOLCKT:1;
      uint64_t UVCOLCKT:1;
      uint64_t PET:1;
      uint64_t BRWNT:1;
      uint64_t ULPWDT:1;
      uint64_t BWERR0T:1;
      uint64_t BWERR1T:1;
      uint64_t reservedSpace1:7;
      uint64_t ECAT0RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRAPSET;

};

#define SCU_TRAP (*(volatile struct SCU_TRAP_tag *) 0x50004160)

struct SCU_HIBERNATE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPEV:1;
      uint64_t ENEV:1;
      uint64_t RTCEV:1;
      uint64_t ULPWDG:1;
      uint64_t HIBNOUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HDSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPEV:1;
      uint64_t ENEV:1;
      uint64_t RTCEV:1;
      uint64_t ULPWDG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HDCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EPEV:1;
      uint64_t ENEV:1;
      uint64_t RTCEV:1;
      uint64_t ULPWDG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HDSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKPEP:1;
      uint64_t WKPEN:1;
      uint64_t RTCE:1;
      uint64_t ULPWDGEN:1;
      uint64_t HIB:1;
      uint64_t reservedSpace0:1;
      uint64_t RCS:1;
      uint64_t STDBYSEL:1;
      uint64_t WKUPSEL:1;
      uint64_t reservedSpace1:1;
      uint64_t GPI0SEL:1;
      uint64_t reservedSpace2:1;
      uint64_t HIBIO0POL:1;
      uint64_t HIBIO1POL:1;
      uint64_t reservedSpace3:2;
      uint64_t HIBIO0SEL:4;
      uint64_t HIBIO1SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HDCR;

