iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCSICTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t X1D:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCULSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t X1DEN:1;
      uint64_t reservedSpace0:3;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCULCTRL;

};

#define SCU_HIBERNATE (*(volatile struct SCU_HIBERNATE_tag *) 0x50004300)

struct SCU_POWER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIBEN:1;
      uint64_t reservedSpace0:15;
      uint64_t USBPHYPDQ:1;
      uint64_t USBOTGEN:1;
      uint64_t USBPUWQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB:1;
      uint64_t reservedSpace0:15;
      uint64_t USBPHYPDQ:1;
      uint64_t USBOTGEN:1;
      uint64_t USBPUWQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIB:1;
      uint64_t reservedSpace0:15;
      uint64_t USBPHYPDQ:1;
      uint64_t USBOTGEN:1;
      uint64_t USBPUWQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCLR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t OV13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC13V:8;
      uint64_t VADC33V:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVRVADCSTAT;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRS:8;
      uint64_t INTV:8;
      uint64_t ENB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRMON;

};

#define SCU_POWER (*(volatile struct SCU_POWER_tag *) 0x50004200)

struct SCU_RESET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTSTAT:8;
      uint64_t HIBWK:1;
      uint64_t HIBRS:1;
      uint64_t LCKEN:1;
      uint64_t reservedSpace0:1;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HIBWK:1;
      uint64_t HIBRS:1;
      uint64_t LCKEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSCLR:1;
      uint64_t reservedSpace0:7;
      uint64_t HIBWK:1;
      uint64_t HIBRS:1;
      uint64_t LCKEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADCRS:1;
      uint64_t DSDRS:1;
      uint64_t CCU40RS:1;
      uint64_t CCU41RS:1;
      uint64_t CCU42RS:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80RS:1;
      uint64_t CCU81RS:1;
      uint64_t POSIF0RS:1;
      uint64_t POSIF1RS:1;
      uint64_t USIC0RS:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADCRS:1;
      uint64_t DSDRS:1;
      uint64_t CCU40RS:1;
      uint64_t CCU41RS:1;
      uint64_t CCU42RS:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80RS:1;
      uint64_t CCU81RS:1;
      uint64_t POSIF0RS:1;
      uint64_t POSIF1RS:1;
      uint64_t USIC0RS:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADCRS:1;
      uint64_t DSDRS:1;
      uint64_t CCU40RS:1;
      uint64_t CCU41RS:1;
      uint64_t CCU42RS:1;
      uint64_t reservedSpace0:2;
      uint64_t CCU80RS:1;
      uint64_t CCU81RS:1;
      uint64_t POSIF0RS:1;
      uint64_t POSIF1RS:1;
      uint64_t USIC0RS:1;
      uint64_t reservedSpace1:4;
      uint64_t ERU1RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43RS:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0RS:1;
      uint64_t MCAN0RS:1;
      uint64_t DACRS:1;
      uint64_t MMCIRS:1;
      uint64_t USIC1RS:1;
      uint64_t USIC2RS:1;
      uint64_t PPORTSRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43RS:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0RS:1;
      uint64_t MCAN0RS:1;
      uint64_t DACRS:1;
      uint64_t MMCIRS:1;
      uint64_t USIC1RS:1;
      uint64_t USIC2RS:1;
      uint64_t PPORTSRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSET1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCU43RS:1;
      uint64_t reservedSpace0:2;
      uint64_t LEDTSCU0RS:1;
      uint64_t MCAN0RS:1;
      uint64_t DACRS:1;
      uint64_t MMCIRS:1;
      uint64_t USIC1RS:1;
      uint64_t USIC2RS:1;
      uint64_t PPORTSRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDTRS:1;
      uint64_t ETH0RS:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0RS:1;
      uint64_t DMA1RS:1;
      uint64_t FCERS:1;
      uint64_t USBRS:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDTRS:1;
      uint64_t ETH0RS:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0RS:1;
      uint64_t DMA1RS:1;
      uint64_t FCERS:1;
      uint64_t USBRS:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSET2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t WDTRS:1;
      uint64_t ETH0RS:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA0RS:1;
      uint64_t DMA1RS:1;
      uint64_t FCERS:1;
      uint64_t USBRS:1;
      uint64_t reservedSpace2:2;
      uint64_t ECAT0RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBURS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSTAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBURS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRSET3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t EBURS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRCLR3;

