iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define SCU_RESET (*(volatile struct SCU_RESET_tag *) 0x50004400)

struct LEDTS0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS_EN:1;
      uint64_t LD_EN:1;
      uint64_t CMTR:1;
      uint64_t ENSYNC:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSCFG:1;
      uint64_t MASKVAL:3;
      uint64_t FENVAL:1;
      uint64_t ITS_EN:1;
      uint64_t ITF_EN:1;
      uint64_t ITP_EN:1;
      uint64_t CLK_PS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADT:3;
      uint64_t PADTSW:1;
      uint64_t EPULL:1;
      uint64_t FNCOL:3;
      uint64_t reservedSpace0:8;
      uint64_t ACCCNT:4;
      uint64_t TSCCMP:1;
      uint64_t TSOEXT:2;
      uint64_t TSCTRR:1;
      uint64_t TSCTRSAT:1;
      uint64_t NR_TSIN:3;
      uint64_t COLLEV:1;
      uint64_t NR_LEDCOL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:1;
      uint64_t TFF:1;
      uint64_t TPF:1;
      uint64_t TSCTROVF:1;
      uint64_t reservedSpace0:12;
      uint64_t CTSF:1;
      uint64_t CTFF:1;
      uint64_t CTPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSCTRVALR:16;
      uint64_t TSCTRVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_0:8;
      uint64_t LINE_1:8;
      uint64_t LINE_2:8;
      uint64_t LINE_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_4:8;
      uint64_t LINE_5:8;
      uint64_t LINE_6:8;
      uint64_t LINE_A:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD0:8;
      uint64_t CMP_LD1:8;
      uint64_t CMP_LD2:8;
      uint64_t CMP_LD3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD4:8;
      uint64_t CMP_LD5:8;
      uint64_t CMP_LD6:8;
      uint64_t CMP_LDA_TSCOM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS0:8;
      uint64_t CMP_TS1:8;
      uint64_t CMP_TS2:8;
      uint64_t CMP_TS3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS4:8;
      uint64_t CMP_TS5:8;
      uint64_t CMP_TS6:8;
      uint64_t CMP_TS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP1;

};

#define LEDTS0 (*(volatile struct LEDTS0_tag *) 0x48010000)

struct SDMMC_CON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t WPSVAL:1;
      uint64_t reservedSpace1:11;
      uint64_t CDSEL:1;
      uint64_t reservedSpace2:3;
      uint64_t CDSVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDMMC_CON_register;

};

#define SDMMC_CON (*(volatile struct SDMMC_CON_tag *) 0x500040b4)

struct SDMMC_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_BLOCK_SIZE:12;
      uint64_t reservedSpace0:3;
      uint64_t TX_BLOCK_SIZE_12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BLOCK_SIZE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BLOCK_COUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BLOCK_COUNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARGUMENT1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARGUMENT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t BLOCK_COUNT_EN:1;
      uint64_t ACMD_EN:2;
      uint64_t TX_DIR_SELECT:1;
      uint64_t MULTI_BLOCK_SELECT:1;
      uint64_t CMD_COMP_ATA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRANSFER_MODE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RESP_TYPE_SELECT:2;
      uint64_t reservedSpace0:1;
      uint64_t CMD_CRC_CHECK_EN:1;
      uint64_t CMD_IND_CHECK_EN:1;
      uint64_t DATA_PRESENT_SELECT:1;
      uint64_t CMD_TYPE:2;
      uint64_t CMD_IND:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COMMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE0:16;
      uint64_t RESPONSE1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESPONSE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE2:16;
      uint64_t RESPONSE3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESPONSE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE4:16;
      uint64_t RESPONSE5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESPONSE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESPONSE6:16;
      uint64_t RESPONSE7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESPONSE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_BUFFER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_BUFFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND_INHIBIT_CMD:1;
      uint64_t COMMAND_INHIBIT_DAT:1;
      uint64_t DAT_LINE_ACTIVE:1;
      uint64_t reservedSpace0:5;
      uint64_t WRITE_TRANSFER_ACTIVE:1;
      uint64_t READ_TRANSFER_ACTIVE:1;
      uint64_t BUFFER_WRITE_ENABLE:1;
      uint64_t BUFFER_READ_ENABLE:1;
      uint64_t reservedSpace1:4;
      uint64_t CARD_INSERTED:1;
      uint64_t CARD_STATE_STABLE:1;
      uint64_t CARD_DETECT_PIN_LEVEL:1;
      uint64_t WRITE_PROTECT_PIN_LEVEL:1;
      uint64_t DAT_3_0_PIN_LEVEL:4;
      uint64_t CMD_LINE_LEVEL:1;
      uint64_t DAT_7_4_PIN_LEVEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRESENT_STATE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LED_CTRL:1;
      uint64_t DATA_TX_WIDTH:1;
      uint64_t HIGH_SPEED_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t SD_8BIT_MODE:1;
      uint64_t CARD_DETECT_TEST_LEVEL:1;
      uint64_t CARD_DET_SIGNAL_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HOST_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SD_BUS_POWER:1;
      uint64_t SD_BUS_VOLTAGE_SEL:3;
      uint64_t HARDWARE_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) POWER_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STOP_AT_BLOCK_GAP:1;
      uint64_t CONTINUE_REQ:1;
      uint64_t READ_WAIT_CTRL:1;
      uint64_t INT_AT_BLOCK_GAP:1;
      uint64_t SPI_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BLOCK_GAP_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WAKEUP_EVENT_EN_INT:1;
      uint64_t WAKEUP_EVENT_EN_INS:1;
      uint64_t WAKEUP_EVENT_EN_REM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WAKEUP_CTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTERNAL_CLOCK_EN:1;
      uint64_t INTERNAL_CLOCK_STABLE:1;
      uint64_t SDCLOCK_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t SDCLK_FREQ_SEL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLOCK_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAT_TIMEOUT_CNT_VAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TIMEOUT_CTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SW_RST_ALL:1;
      uint64_t SW_RST_CMD_LINE:1;
      uint64_t SW_RST_DAT_LINE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SW_RESET;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_COMPLETE:1;
      uint64_t TX_COMPLETE:1;
      uint64_t BLOCK_GAP_EVENT:1;
      uint64_t reservedSpace0:1;
      uint64_t BUFF_WRITE_READY:1;
      uint64_t BUFF_READ_READY:1;
      uint64_t CARD_INS:1;
      uint64_t CARD_REMOVAL:1;
      uint64_t CARD_INT:1;
      uint64_t reservedSpace1:6;
      uint64_t ERR_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INT_STATUS_NORM;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_TIMEOUT_ERR:1;
      uint64_t CMD_CRC_ERR:1;
      uint64_t CMD_END_BIT_ERR:1;
      uint64_t CMD_IND_ERR:1;
      uint64_t DATA_TIMEOUT_ERR:1;
      uint64_t DATA_CRC_ERR:1;
      uint64_t DATA_END_BIT_ERR:1;
      uint64_t CURRENT_LIMIT_ERR:1;
      uint64_t ACMD_ERR:1;
      uint64_t reservedSpace0:4;
      uint64_t CEATA_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INT_STATUS_ERR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_COMPLETE_EN:1;
      uint64_t TX_COMPLETE_EN:1;
      uint64_t BLOCK_GAP_EVENT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t BUFF_WRITE_READY_EN:1;
      uint64_t BUFF_READ_READY_EN:1;
      uint64_t CARD_INS_EN:1;
      uint64_t CARD_REMOVAL_EN:1;
      uint64_t CARD_INT_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t FIXED_TO_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EN_INT_STATUS_NORM;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_TIMEOUT_ERR_EN:1;
      uint64_t CMD_CRC_ERR_EN:1;
      uint64_t CMD_END_BIT_ERR_EN:1;
      uint64_t CMD_IND_ERR_EN:1;
      uint64_t DATA_TIMEOUT_ERR_EN:1;
      uint64_t DATA_CRC_ERR_EN:1;
      uint64_t DATA_END_BIT_ERR_EN:1;
      uint64_t CURRENT_LIMIT_ERR_EN:1;
      uint64_t ACMD_ERR_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t TARGET_RESP_ERR_EN:1;
      uint64_t CEATA_ERR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EN_INT_STATUS_ERR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_COMPLETE_EN:1;
      uint64_t TX_COMPLETE_EN:1;
      uint64_t BLOCK_GAP_EVENT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t BUFF_WRITE_READY_EN:1;
      uint64_t BUFF_READ_READY_EN:1;
      uint64_t CARD_INS_EN:1;
      uint64_t CARD_REMOVAL_EN:1;
      uint64_t CARD_INT_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t FIXED_TO_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EN_INT_SIGNAL_NORM;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMD_TIMEOUT_ERR_EN:1;
      uint64_t CMD_CRC_ERR_EN:1;
      uint64_t CMD_END_BIT_ERR_EN:1;
      uint64_t CMD_IND_ERR_EN:1;
      uint64_t DATA_TIMEOUT_ERR_EN:1;
      uint64_t DATA_CRC_ERR_EN:1;
      uint64_t DATA_END_BIT_ERR_EN:1;
      uint64_t CURRENT_LIMIT_ERR_EN:1;
      uint64_t ACMD_ERR_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t TARGET_RESP_ERR_EN:1;
      uint64_t CEATA_ERR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EN_INT_SIGNAL_ERR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ACMD12_NOT_EXEC_ERR:1;
      uint64_t ACMD_TIMEOUT_ERR:1;
      uint64_t ACMD_CRC_ERR:1;
      uint64_t ACMD_END_BIT_ERR:1;
      uint64_t ACMD_IND_ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t CMD_NOT_ISSUED_BY_ACMD12_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ACMD_ERR_STATUS;

  uint8_t res0[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMEOUT_CLOCK_FREQ:6;
      uint64_t reservedSpace0:1;
      uint64_t TIMEOUT_CLOCK_UNIT:1;
      uint64_t BASE_SD_CLOCK_FREQ:8;
      uint64_t MAX_BLOCK_LENGTH:2;
      uint64_t EXT_MEDIA_BUS_SUPPORT:1;
      uint64_t ADMA2_SUPPORT:1;
      uint64_t reservedSpace1:1;
      uint64_t HIGH_SPEED_SUPPORT:1;
      uint64_t SDMA_SUPPORT:1;
      uint64_t SUSPEND_RESUME_SUPPORT:1;
      uint64_t VOLTAGE_SUPPORT_3_3V:1;
      uint64_t VOLTAGE_SUPPORT_3V:1;
      uint64_t VOLTAGE_SUPPORT_1_8V:1;
      uint64_t reservedSpace2:1;
      uint64_t SYSBUS_64_SUPPORT:1;
      uint64_t ASYNC_INT_SUPPORT:1;
      uint64_t SLOT_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPABILITIES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDR50_SUPPORT:1;
      uint64_t SDR104_SUPPORT:1;
      uint64_t DDR50_SUPPORT:1;
      uint64_t reservedSpace0:1;
      uint64_t DRV_A_SUPPORT:1;
      uint64_t DRV_C_SUPPORT:1;
      uint64_t DRV_D_SUPPORT:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM_CNT_RETUNE:4;
      uint64_t reservedSpace2:1;
      uint64_t USE_TUNING_SDR50:1;
      uint64_t RE_TUNING_MODES:2;
      uint64_t CLK_MULT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPABILITIES_HI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_CURRENT_FOR_3_3V:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAX_CURRENT_CAP;

