iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FE_ACMD_NOT_EXEC:1;
      uint64_t FE_ACMD_TIMEOUT_ERR:1;
      uint64_t FE_ACMD_CRC_ERR:1;
      uint64_t FE_ACMD_END_BIT_ERR:1;
      uint64_t FE_ACMD_IND_ERR:1;
      uint64_t reservedSpace0:2;
      uint64_t FE_CMD_NOT_ISSUED_ACMD12_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FORCE_EVENT_ACMD_ERR_STATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FE_CMD_TIMEOUT_ERR:1;
      uint64_t FE_CMD_CRC_ERR:1;
      uint64_t FE_CMD_END_BIT_ERR:1;
      uint64_t FE_CMD_IND_ERR:1;
      uint64_t FE_DATA_TIMEOUT_ERR:1;
      uint64_t FE_DATA_CRC_ERR:1;
      uint64_t FE_DATA_END_BIT_ERR:1;
      uint64_t FE_CURRENT_LIMIT_ERR:1;
      uint64_t FE_ACMD12_ERR:1;
      uint64_t reservedSpace0:3;
      uint64_t FE_TARGET_RESPONSE_ERR:1;
      uint64_t FE_CEATA_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FORCE_EVENT_ERR_STATUS;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEBUG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG_SEL;

  uint8_t res3[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_INT_SUPPORT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI;

  uint8_t res4[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SLOT_INT_STATUS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SLOT_INT_STATUS;

};

#define SDMMC (*(volatile struct SDMMC_tag *) 0x4801c004)

struct EBU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:14;
      uint64_t SYNC:1;
      uint64_t DIV2:1;
      uint64_t EBUDIV:2;
      uint64_t SYNCACK:1;
      uint64_t DIV2ACK:1;
      uint64_t EBUDIVACK:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STS:1;
      uint64_t LCKABRT:1;
      uint64_t SDTRI:1;
      uint64_t reservedSpace0:1;
      uint64_t EXTLOCK:1;
      uint64_t ARBSYNC:1;
      uint64_t ARBMODE:2;
      uint64_t TIMEOUTC:8;
      uint64_t LOCKTIMEOUT:8;
      uint64_t GLOBALCS:4;
      uint64_t ACCSINH:1;
      uint64_t ACCSINHACK:1;
      uint64_t reservedSpace1:1;
      uint64_t ALE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIP:1;
      uint64_t reservedSpace0:15;
      uint64_t ADDIO:9;
      uint64_t ADVIO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USERCON;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGENAB:1;
      uint64_t ALTENAB:1;
      uint64_t WPROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRSEL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGENAB:1;
      uint64_t ALTENAB:1;
      uint64_t WPROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRSEL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGENAB:1;
      uint64_t ALTENAB:1;
      uint64_t WPROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRSEL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGENAB:1;
      uint64_t ALTENAB:1;
      uint64_t WPROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDRSEL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t BFSSS:1;
      uint64_t FDBKEN:1;
      uint64_t BFCMSEL:1;
      uint64_t NAA:1;
      uint64_t reservedSpace0:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t DBA:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t reservedSpace1:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRCON0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDDTACS:4;
      uint64_t RDRECOVC:3;
      uint64_t WAITRDC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t NAA:1;
      uint64_t reservedSpace1:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t reservedSpace2:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t LOCKCS:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWCON0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDTACS:4;
      uint64_t WRRECOVC:3;
      uint64_t WAITWRC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWAP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t BFSSS:1;
      uint64_t FDBKEN:1;
      uint64_t BFCMSEL:1;
      uint64_t NAA:1;
      uint64_t reservedSpace0:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t DBA:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t reservedSpace1:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRCON1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDDTACS:4;
      uint64_t RDRECOVC:3;
      uint64_t WAITRDC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t NAA:1;
      uint64_t reservedSpace1:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t reservedSpace2:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t LOCKCS:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWCON1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDTACS:4;
      uint64_t WRRECOVC:3;
      uint64_t WAITWRC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWAP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t BFSSS:1;
      uint64_t FDBKEN:1;
      uint64_t BFCMSEL:1;
      uint64_t NAA:1;
      uint64_t reservedSpace0:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t DBA:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t reservedSpace1:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRCON2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDDTACS:4;
      uint64_t RDRECOVC:3;
      uint64_t WAITRDC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t NAA:1;
      uint64_t reservedSpace1:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t reservedSpace2:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t LOCKCS:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWCON2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDTACS:4;
      uint64_t WRRECOVC:3;
      uint64_t WAITWRC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWAP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t BFSSS:1;
      uint64_t FDBKEN:1;
      uint64_t BFCMSEL:1;
      uint64_t NAA:1;
      uint64_t reservedSpace0:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t DBA:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t reservedSpace1:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRCON3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDDTACS:4;
      uint64_t RDRECOVC:3;
      uint64_t WAITRDC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSRAP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FETBLEN:3;
      uint64_t FBBMSEL:1;
      uint64_t reservedSpace0:3;
      uint64_t NAA:1;
      uint64_t reservedSpace1:8;
      uint64_t ECSE:1;
      uint64_t EBSE:1;
      uint64_t reservedSpace2:1;
      uint64_t WAITINV:1;
      uint64_t BCGEN:2;
      uint64_t PORTW:2;
      uint64_t WAIT:2;
      uint64_t AAP:1;
      uint64_t LOCKCS:1;
      uint64_t AGEN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWCON3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDTACS:4;
      uint64_t WRRECOVC:3;
      uint64_t WAITWRC:5;
      uint64_t DATAC:4;
      uint64_t EXTCLOCK:2;
      uint64_t EXTDATA:2;
      uint64_t CMDDELAY:4;
      uint64_t AHOLDC:4;
      uint64_t ADDRC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUSWAP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRAS:4;
      uint64_t CRFSH:4;
      uint64_t CRSC:2;
      uint64_t CRP:2;
      uint64_t AWIDTH:2;
      uint64_t CRCD:2;
      uint64_t CRC:3;
      uint64_t ROWM:3;
      uint64_t BANKM:3;
      uint64_t CRCE:3;
      uint64_t CLKDIS:1;
      uint64_t PWR_MODE:2;
      uint64_t SDCMSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRMCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BURSTL:3;
      uint64_t BTYP:1;
      uint64_t CASLAT:3;
      uint64_t OPMODE:7;
      uint64_t reservedSpace0:1;
      uint64_t COLDSTART:1;
      uint64_t XOPM:12;
      uint64_t XBA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRMOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFRESHC:6;
      uint64_t REFRESHR:3;
      uint64_t SELFREXST:1;
      uint64_t SELFREX:1;
      uint64_t SELFRENST:1;
      uint64_t SELFREN:1;
      uint64_t AUTOSELFR:1;
      uint64_t ERFSHC:2;
      uint64_t SELFREX_DLY:8;
      uint64_t ARFSH:1;
      uint64_t RES_DLY:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRMREF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFERR:1;
      uint64_t SDRMBUSY:1;
      uint64_t SDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDRSTAT;

