iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define EBU (*(volatile struct EBU_tag *) 0x58008000)

struct ETH0_CON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXD0:2;
      uint64_t RXD1:2;
      uint64_t RXD2:2;
      uint64_t RXD3:2;
      uint64_t CLK_RMII:2;
      uint64_t CRS_DV:2;
      uint64_t CRS:2;
      uint64_t RXER:2;
      uint64_t COL:2;
      uint64_t CLK_TX:2;
      uint64_t reservedSpace0:2;
      uint64_t MDIO:2;
      uint64_t reservedSpace1:2;
      uint64_t INFSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETH0_CON_register;

};

#define ETH0_CON (*(volatile struct ETH0_CON_tag *) 0x50004040)

struct ETH0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRELEN:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t ACS:1;
      uint64_t reservedSpace0:1;
      uint64_t DR:1;
      uint64_t IPC:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t DO:1;
      uint64_t FES:1;
      uint64_t reservedSpace1:1;
      uint64_t DCRS:1;
      uint64_t IFG:3;
      uint64_t JE:1;
      uint64_t BE:1;
      uint64_t JD:1;
      uint64_t WD:1;
      uint64_t TC:1;
      uint64_t CST:1;
      uint64_t reservedSpace2:1;
      uint64_t TWOKPE:1;
      uint64_t SARC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_CONFIGURATION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:1;
      uint64_t HUC:1;
      uint64_t HMC:1;
      uint64_t DAIF:1;
      uint64_t PM:1;
      uint64_t DBF:1;
      uint64_t PCF:2;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t HPF:1;
      uint64_t reservedSpace0:5;
      uint64_t VTFE:1;
      uint64_t reservedSpace1:3;
      uint64_t IPFE:1;
      uint64_t DNTU:1;
      uint64_t reservedSpace2:9;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_FRAME_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_TABLE_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HASH_TABLE_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t MW:1;
      uint64_t CR:4;
      uint64_t MR:5;
      uint64_t PA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMII_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMII_DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCA_BPA:1;
      uint64_t TFE:1;
      uint64_t RFE:1;
      uint64_t UP:1;
      uint64_t PLT:2;
      uint64_t reservedSpace0:1;
      uint64_t DZPQ:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLOW_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VL:16;
      uint64_t ETV:1;
      uint64_t VTIM:1;
      uint64_t ESVL:1;
      uint64_t VTHM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VLAN_TAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SNPSVER:8;
      uint64_t USERVER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPESTS:1;
      uint64_t RFCFCSTS:2;
      uint64_t reservedSpace0:1;
      uint64_t RWCSTS:1;
      uint64_t RRCSTS:2;
      uint64_t reservedSpace1:1;
      uint64_t RXFSTS:2;
      uint64_t reservedSpace2:6;
      uint64_t TPESTS:1;
      uint64_t TFCSTS:2;
      uint64_t TXPAUSED:1;
      uint64_t TRCSTS:2;
      uint64_t TWCSTS:1;
      uint64_t reservedSpace3:1;
      uint64_t TXFSTS:1;
      uint64_t TXSTSFSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEBUG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WKUPFRMFTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REMOTE_WAKE_UP_FRAME_FILTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWRDWN:1;
      uint64_t MGKPKTEN:1;
      uint64_t RWKPKTEN:1;
      uint64_t reservedSpace0:2;
      uint64_t MGKPRCVD:1;
      uint64_t RWKPRCVD:1;
      uint64_t reservedSpace1:2;
      uint64_t GLBLUCAST:1;
      uint64_t reservedSpace2:21;
      uint64_t RWKFILTRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMT_CONTROL_STATUS;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIS:1;
      uint64_t MMCIS:1;
      uint64_t MMCRXIS:1;
      uint64_t MMCTXIS:1;
      uint64_t MMCRXIPIS:1;
      uint64_t reservedSpace1:1;
      uint64_t TSIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRUPT_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TSIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRUPT_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:15;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS0_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS0_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS1_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS1_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS2_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS2_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRHI:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS3_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDRLO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_ADDRESS3_LOW;

  uint8_t res1[160];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTRST:1;
      uint64_t CNTSTOPRO:1;
      uint64_t RSTONRD:1;
      uint64_t CNTFREEZ:1;
      uint64_t CNTPRST:1;
      uint64_t CNTPRSTLVL:1;
      uint64_t reservedSpace0:2;
      uint64_t UCDBC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXGBFRMIS:1;
      uint64_t RXGBOCTIS:1;
      uint64_t RXGOCTIS:1;
      uint64_t RXBCGFIS:1;
      uint64_t RXMCGFIS:1;
      uint64_t RXCRCERFIS:1;
      uint64_t RXALGNERFIS:1;
      uint64_t RXRUNTFIS:1;
      uint64_t RXJABERFIS:1;
      uint64_t RXUSIZEGFIS:1;
      uint64_t RXOSIZEGFIS:1;
      uint64_t RX64OCTGBFIS:1;
      uint64_t RX65T127OCTGBFIS:1;
      uint64_t RX128T255OCTGBFIS:1;
      uint64_t RX256T511OCTGBFIS:1;
      uint64_t RX512T1023OCTGBFIS:1;
      uint64_t RX1024TMAXOCTGBFIS:1;
      uint64_t RXUCGFIS:1;
      uint64_t RXLENERFIS:1;
      uint64_t RXORANGEFIS:1;
      uint64_t RXPAUSFIS:1;
      uint64_t RXFOVFIS:1;
      uint64_t RXVLANGBFIS:1;
      uint64_t RXWDOGFIS:1;
      uint64_t RXRCVERRFIS:1;
      uint64_t RXCTRLFIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RECEIVE_INTERRUPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXGBOCTIS:1;
      uint64_t TXGBFRMIS:1;
      uint64_t TXBCGFIS:1;
      uint64_t TXMCGFIS:1;
      uint64_t TX64OCTGBFIS:1;
      uint64_t TX65T127OCTGBFIS:1;
      uint64_t TX128T255OCTGBFIS:1;
      uint64_t TX256T511OCTGBFIS:1;
      uint64_t TX512T1023OCTGBFIS:1;
      uint64_t TX1024TMAXOCTGBFIS:1;
      uint64_t TXUCGBFIS:1;
      uint64_t TXMCGBFIS:1;
      uint64_t TXBCGBFIS:1;
      uint64_t TXUFLOWERFIS:1;
      uint64_t TXSCOLGFIS:1;
      uint64_t TXMCOLGFIS:1;
      uint64_t TXDEFFIS:1;
      uint64_t TXLATCOLFIS:1;
      uint64_t TXEXCOLFIS:1;
      uint64_t TXCARERFIS:1;
      uint64_t TXGOCTIS:1;
      uint64_t TXGFRMIS:1;
      uint64_t TXEXDEFFIS:1;
      uint64_t TXPAUSFIS:1;
      uint64_t TXVLANGFIS:1;
      uint64_t TXOSIZEGFIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TRANSMIT_INTERRUPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXGBFRMIM:1;
      uint64_t RXGBOCTIM:1;
      uint64_t RXGOCTIM:1;
      uint64_t RXBCGFIM:1;
      uint64_t RXMCGFIM:1;
      uint64_t RXCRCERFIM:1;
      uint64_t RXALGNERFIM:1;
      uint64_t RXRUNTFIM:1;
      uint64_t RXJABERFIM:1;
      uint64_t RXUSIZEGFIM:1;
      uint64_t RXOSIZEGFIM:1;
      uint64_t RX64OCTGBFIM:1;
      uint64_t RX65T127OCTGBFIM:1;
      uint64_t RX128T255OCTGBFIM:1;
      uint64_t RX256T511OCTGBFIM:1;
      uint64_t RX512T1023OCTGBFIM:1;
      uint64_t RX1024TMAXOCTGBFIM:1;
      uint64_t RXUCGFIM:1;
      uint64_t RXLENERFIM:1;
      uint64_t RXORANGEFIM:1;
      uint64_t RXPAUSFIM:1;
      uint64_t RXFOVFIM:1;
      uint64_t RXVLANGBFIM:1;
      uint64_t RXWDOGFIM:1;
      uint64_t RXRCVERRFIM:1;
      uint64_t RXCTRLFIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_RECEIVE_INTERRUPT_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXGBOCTIM:1;
      uint64_t TXGBFRMIM:1;
      uint64_t TXBCGFIM:1;
      uint64_t TXMCGFIM:1;
      uint64_t TX64OCTGBFIM:1;
      uint64_t TX65T127OCTGBFIM:1;
      uint64_t TX128T255OCTGBFIM:1;
      uint64_t TX256T511OCTGBFIM:1;
      uint64_t TX512T1023OCTGBFIM:1;
      uint64_t TX1024TMAXOCTGBFIM:1;
      uint64_t TXUCGBFIM:1;
      uint64_t TXMCGBFIM:1;
      uint64_t TXBCGBFIM:1;
      uint64_t TXUFLOWERFIM:1;
      uint64_t TXSCOLGFIM:1;
      uint64_t TXMCOLGFIM:1;
      uint64_t TXDEFFIM:1;
      uint64_t TXLATCOLFIM:1;
      uint64_t TXEXCOLFIM:1;
      uint64_t TXCARERFIM:1;
      uint64_t TXGOCTIM:1;
      uint64_t TXGFRMIM:1;
      uint64_t TXEXDEFFIM:1;
      uint64_t TXPAUSFIM:1;
      uint64_t TXVLANGFIM:1;
      uint64_t TXOSIZEGFIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_TRANSMIT_INTERRUPT_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXOCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_OCTET_COUNT_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFRMGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FRAME_COUNT_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_BROADCAST_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_MULTICAST_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX64OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_64OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX65_127OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_65TO127OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX128_255OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_128TO255OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX256_511OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_256TO511OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX512_1023OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_512TO1023OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX1024_MAXOCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUCASTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_UNICAST_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMCASTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_MULTICAST_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBCASTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_BROADCAST_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNDRFLW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_UNDERFLOW_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXSNGLCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_SINGLE_COLLISION_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMULTCOLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_MULTIPLE_COLLISION_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDEFRD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_DEFERRED_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLATECOL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_LATE_COLLISION_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXEXSCOL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_EXCESSIVE_COLLISION_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCARR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_CARRIER_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXOCTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_OCTET_COUNT_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFRMG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FRAME_COUNT_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXEXSDEF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_EXCESSIVE_DEFERRAL_ERROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPAUSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_PAUSE_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXVLANG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_VLAN_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXOSIZG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_OSIZE_FRAMES_GOOD;

