iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFRMGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FRAMES_COUNT_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_OCTET_COUNT_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOCTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_OCTET_COUNT_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_BROADCAST_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_MULTICAST_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCRCERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CRC_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXALGNERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_ALIGNMENT_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRUNTERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_RUNT_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXJABERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_JABBER_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUNDERSZG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_UNDERSIZE_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVERSZG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_OVERSIZE_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX64OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_64OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX65_127OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_65TO127OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX128_255OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_128TO255OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX256_511OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_256TO511OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX512_1023OCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_512TO1023OCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX1024_MAXOCTGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUCASTG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_UNICAST_FRAMES_GOOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXLENERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_LENGTH_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOUTOFRNG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_OUT_OF_RANGE_TYPE_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPAUSEFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_PAUSE_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOOVFL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_OVERFLOW_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXVLANFRGB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_VLAN_FRAMES_GOOD_BAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXWDGERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_WATCHDOG_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRCVERR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_RECEIVE_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTRLG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CONTROL_FRAMES_GOOD;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4GFIM:1;
      uint64_t RXIPV4HERFIM:1;
      uint64_t RXIPV4NOPAYFIM:1;
      uint64_t RXIPV4FRAGFIM:1;
      uint64_t RXIPV4UDSBLFIM:1;
      uint64_t RXIPV6GFIM:1;
      uint64_t RXIPV6HERFIM:1;
      uint64_t RXIPV6NOPAYFIM:1;
      uint64_t RXUDPGFIM:1;
      uint64_t RXUDPERFIM:1;
      uint64_t RXTCPGFIM:1;
      uint64_t RXTCPERFIM:1;
      uint64_t RXICMPGFIM:1;
      uint64_t RXICMPERFIM:1;
      uint64_t reservedSpace0:2;
      uint64_t RXIPV4GOIM:1;
      uint64_t RXIPV4HEROIM:1;
      uint64_t RXIPV4NOPAYOIM:1;
      uint64_t RXIPV4FRAGOIM:1;
      uint64_t RXIPV4UDSBLOIM:1;
      uint64_t RXIPV6GOIM:1;
      uint64_t RXIPV6HEROIM:1;
      uint64_t RXIPV6NOPAYOIM:1;
      uint64_t RXUDPGOIM:1;
      uint64_t RXUDPEROIM:1;
      uint64_t RXTCPGOIM:1;
      uint64_t RXTCPEROIM:1;
      uint64_t RXICMPGOIM:1;
      uint64_t RXICMPEROIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_IPC_RECEIVE_INTERRUPT_MASK;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4GFIS:1;
      uint64_t RXIPV4HERFIS:1;
      uint64_t RXIPV4NOPAYFIS:1;
      uint64_t RXIPV4FRAGFIS:1;
      uint64_t RXIPV4UDSBLFIS:1;
      uint64_t RXIPV6GFIS:1;
      uint64_t RXIPV6HERFIS:1;
      uint64_t RXIPV6NOPAYFIS:1;
      uint64_t RXUDPGFIS:1;
      uint64_t RXUDPERFIS:1;
      uint64_t RXTCPGFIS:1;
      uint64_t RXTCPERFIS:1;
      uint64_t RXICMPGFIS:1;
      uint64_t RXICMPERFIS:1;
      uint64_t reservedSpace0:2;
      uint64_t RXIPV4GOIS:1;
      uint64_t RXIPV4HEROIS:1;
      uint64_t RXIPV4NOPAYOIS:1;
      uint64_t RXIPV4FRAGOIS:1;
      uint64_t RXIPV4UDSBLOIS:1;
      uint64_t RXIPV6GOIS:1;
      uint64_t RXIPV6HEROIS:1;
      uint64_t RXIPV6NOPAYOIS:1;
      uint64_t RXUDPGOIS:1;
      uint64_t RXUDPEROIS:1;
      uint64_t RXTCPGOIS:1;
      uint64_t RXTCPEROIS:1;
      uint64_t RXICMPGOIS:1;
      uint64_t RXICMPEROIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_IPC_RECEIVE_INTERRUPT;

