iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4GDFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4HDRERRFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_HEADER_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4NOPAYFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_NO_PAYLOAD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4FRAGFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_FRAGMENTED_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4UDSBLFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6GDFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6HDRERRFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_HEADER_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6NOPAYFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_NO_PAYLOAD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUDPGDFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUDP_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUDPERRFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUDP_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTCPGDFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTCP_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTCPERRFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTCP_ERROR_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXICMPGDFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXICMP_GOOD_FRAMES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXICMPERRFRM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXICMP_ERROR_FRAMES;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4GDOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_GOOD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4HDRERROCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_HEADER_ERROR_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4NOPAYOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_NO_PAYLOAD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4FRAGOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_FRAGMENTED_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV4UDSBLOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6GDOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_GOOD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6HDRERROCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_HEADER_ERROR_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXIPV6NOPAYOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXIPV6_NO_PAYLOAD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUDPGDOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUDP_GOOD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXUDPERROCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXUDP_ERROR_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTCPGDOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTCP_GOOD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTCPERROCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXTCP_ERROR_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXICMPGDOCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXICMP_GOOD_OCTETS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXICMPERROCT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RXICMP_ERROR_OCTETS;

  uint8_t res7[1144];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSENA:1;
      uint64_t TSCFUPDT:1;
      uint64_t TSINIT:1;
      uint64_t TSUPDT:1;
      uint64_t TSTRIG:1;
      uint64_t TSADDREG:1;
      uint64_t reservedSpace0:2;
      uint64_t TSENALL:1;
      uint64_t TSCTRLSSR:1;
      uint64_t TSVER2ENA:1;
      uint64_t TSIPENA:1;
      uint64_t TSIPV6ENA:1;
      uint64_t TSIPV4ENA:1;
      uint64_t TSEVNTENA:1;
      uint64_t TSMSTRENA:1;
      uint64_t SNAPTYPSEL:2;
      uint64_t TSENMACADDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMESTAMP_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSINC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUB_SECOND_INCREMENT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_TIME_SECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_TIME_NANOSECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_TIME_SECONDS_UPDATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSS:31;
      uint64_t ADDSUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_TIME_NANOSECONDS_UPDATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMESTAMP_ADDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TARGET_TIME_SECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TTSLO:31;
      uint64_t TRGTBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TARGET_TIME_NANOSECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSHWR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSTEM_TIME_HIGHER_WORD_SECONDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSSOVF:1;
      uint64_t TSTARGT:1;
      uint64_t reservedSpace0:1;
      uint64_t TSTRGTERR:1;
      uint64_t TSTARGT1:1;
      uint64_t TSTRGTERR1:1;
      uint64_t TSTARGT2:1;
      uint64_t TSTRGTERR2:1;
      uint64_t TSTARGT3:1;
      uint64_t TSTRGTERR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMESTAMP_STATUS;

