iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res8[2260];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWR:1;
      uint64_t DA:1;
      uint64_t DSL:5;
      uint64_t ATDS:1;
      uint64_t PBL:6;
      uint64_t PR:2;
      uint64_t FB:1;
      uint64_t RPBL:6;
      uint64_t USP:1;
      uint64_t PBLX8:1;
      uint64_t AAL:1;
      uint64_t MB:1;
      uint64_t TXPR:1;
      uint64_t PRWG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUS_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANSMIT_POLL_DEMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECEIVE_POLL_DEMAND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RDESLA_32bit:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECEIVE_DESCRIPTOR_LIST_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TDESLA_32bit:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRANSMIT_DESCRIPTOR_LIST_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TI:1;
      uint64_t TPS:1;
      uint64_t TU:1;
      uint64_t TJT:1;
      uint64_t OVF:1;
      uint64_t UNF:1;
      uint64_t RI:1;
      uint64_t RU:1;
      uint64_t RPS:1;
      uint64_t RWT:1;
      uint64_t ETI:1;
      uint64_t reservedSpace0:2;
      uint64_t FBI:1;
      uint64_t ERI:1;
      uint64_t AIS:1;
      uint64_t NIS:1;
      uint64_t RS:3;
      uint64_t TS:3;
      uint64_t EB:3;
      uint64_t reservedSpace1:1;
      uint64_t EMI:1;
      uint64_t EPI:1;
      uint64_t TTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SR:1;
      uint64_t OSF:1;
      uint64_t RTC_bitfield:2;
      uint64_t reservedSpace1:1;
      uint64_t FUF:1;
      uint64_t FEF:1;
      uint64_t reservedSpace2:5;
      uint64_t ST:1;
      uint64_t TTC:3;
      uint64_t reservedSpace3:3;
      uint64_t FTF:1;
      uint64_t TSF:1;
      uint64_t reservedSpace4:2;
      uint64_t DFF:1;
      uint64_t RSF:1;
      uint64_t DT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OPERATION_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE:1;
      uint64_t TSE:1;
      uint64_t TUE:1;
      uint64_t TJE:1;
      uint64_t OVE:1;
      uint64_t UNE:1;
      uint64_t RIE:1;
      uint64_t RUE:1;
      uint64_t RSE:1;
      uint64_t RWE:1;
      uint64_t ETE:1;
      uint64_t reservedSpace0:2;
      uint64_t FBE:1;
      uint64_t ERE:1;
      uint64_t AIE:1;
      uint64_t NIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTERRUPT_ENABLE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISFRMCNT:16;
      uint64_t MISCNTOVF:1;
      uint64_t OVFFRMCNT:11;
      uint64_t OVFCNTOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIWT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECEIVE_INTERRUPT_WATCHDOG_TIMER;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AHBMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHB_STATUS;

  uint8_t res10[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURTDESAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURRENT_HOST_TRANSMIT_DESCRIPTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRDESAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURRENT_HOST_RECEIVE_DESCRIPTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURTBUFAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRBUFAPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CURRENT_HOST_RECEIVE_BUFFER_ADDRESS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIISEL:1;
      uint64_t GMIISEL:1;
      uint64_t HDSEL:1;
      uint64_t EXTHASHEN:1;
      uint64_t HASHSEL:1;
      uint64_t ADDMACADRSEL:1;
      uint64_t PCSSEL:1;
      uint64_t L3L4FLTREN:1;
      uint64_t SMASEL:1;
      uint64_t RWKSEL:1;
      uint64_t MGKSEL:1;
      uint64_t MMCSEL:1;
      uint64_t TSVER1SEL:1;
      uint64_t TSVER2SEL:1;
      uint64_t EEESEL:1;
      uint64_t AVSEL:1;
      uint64_t TXCOESEL:1;
      uint64_t RXTYP1COE:1;
      uint64_t RXTYP2COE:1;
      uint64_t RXFIFOSIZE:1;
      uint64_t RXCHCNT:2;
      uint64_t TXCHCNT:2;
      uint64_t ENHDESSEL:1;
      uint64_t INTTSEN:1;
      uint64_t FLEXIPPSEN:1;
      uint64_t SAVLANINS:1;
      uint64_t ACTPHYIF:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HW_FEATURE;

};

#define ETH0 (*(volatile struct ETH0_tag *) 0x5000c000)

struct ECAT0_CON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECATRSTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t LATCHIN0SEL:2;
      uint64_t reservedSpace1:1;
      uint64_t LATCHIN0:1;
      uint64_t LATCHIN1SEL:2;
      uint64_t reservedSpace2:1;
      uint64_t LATCHIN1:1;
      uint64_t PHYOFFSET:5;
      uint64_t reservedSpace3:1;
      uint64_t MDIO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXD0:2;
      uint64_t RXD1:2;
      uint64_t RXD2:2;
      uint64_t RXD3:2;
      uint64_t RX_ERR:2;
      uint64_t RX_DV:2;
      uint64_t RX_CLK:2;
      uint64_t reservedSpace0:2;
      uint64_t LINK:2;
      uint64_t reservedSpace1:10;
      uint64_t TX_CLK:2;
      uint64_t TX_SHIFT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXD0:2;
      uint64_t RXD1:2;
      uint64_t RXD2:2;
      uint64_t RXD3:2;
      uint64_t RX_ERR:2;
      uint64_t RX_DV:2;
      uint64_t RX_CLK:2;
      uint64_t reservedSpace0:2;
      uint64_t LINK:2;
      uint64_t reservedSpace1:10;
      uint64_t TX_CLK:2;
      uint64_t TX_SHIFT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONP1;

