iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define ECAT0_CON (*(volatile struct ECAT0_CON_tag *) 0x500041b0)

struct ECAT0_FMMU0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU0 (*(volatile struct ECAT0_FMMU0_tag *) 0x54010600)

struct ECAT0_FMMU1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU1 (*(volatile struct ECAT0_FMMU1_tag *) 0x54010610)

struct ECAT0_FMMU2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU2 (*(volatile struct ECAT0_FMMU2_tag *) 0x54010620)

struct ECAT0_FMMU3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU3 (*(volatile struct ECAT0_FMMU3_tag *) 0x54010630)

struct ECAT0_FMMU4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

