iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define ECAT0_FMMU4 (*(volatile struct ECAT0_FMMU4_tag *) 0x54010640)

struct ECAT0_FMMU5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU5 (*(volatile struct ECAT0_FMMU5_tag *) 0x54010650)

struct ECAT0_FMMU6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU6 (*(volatile struct ECAT0_FMMU6_tag *) 0x54010660)

struct ECAT0_FMMU7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t L_START_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMMU_L_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t L_STOP_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_L_STOP_BIT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P_START_ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FMMU_P_START_ADR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P_START_BIT:3;
      uint64_t Res:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_P_START_BIT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t R_ACC:1;
      uint64_t W_ACC:1;
      uint64_t Res:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_TYPE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ACT:1;
      uint64_t Res:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FMMU_ACT;

};

#define ECAT0_FMMU7 (*(volatile struct ECAT0_FMMU7_tag *) 0x54010670)

struct ECAT0_SM0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM0 (*(volatile struct ECAT0_SM0_tag *) 0x54010800)

struct ECAT0_SM1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

