iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define ECAT0_SM1 (*(volatile struct ECAT0_SM1_tag *) 0x54010808)

struct ECAT0_SM2_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM2 (*(volatile struct ECAT0_SM2_tag *) 0x54010810)

struct ECAT0_SM3_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM3 (*(volatile struct ECAT0_SM3_tag *) 0x54010818)

struct ECAT0_SM4_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM4 (*(volatile struct ECAT0_SM4_tag *) 0x54010820)

struct ECAT0_SM5_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM5 (*(volatile struct ECAT0_SM5_tag *) 0x54010828)

struct ECAT0_SM6_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

