iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define ECAT0_SM6 (*(volatile struct ECAT0_SM6_tag *) 0x54010830)

struct ECAT0_SM7_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIRST_BYTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_P_START_ADR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NO_BYTES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SM_LEN;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OP_MODE:2;
      uint64_t DIR:2;
      uint64_t INT_ECAT:1;
      uint64_t INT_PDI:1;
      uint64_t WD_TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_CONTROL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INT_W:1;
      uint64_t INT_R:1;
      uint64_t reservedSpace0:1;
      uint64_t MB_STATUS:1;
      uint64_t BUF_STATUS:2;
      uint64_t R_BUF_IU:1;
      uint64_t W_BUF_IU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_STATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SM_EN:1;
      uint64_t REP_REQ:1;
      uint64_t reservedSpace0:4;
      uint64_t LE_ECAT:1;
      uint64_t LE_PDI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_ACT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DEACT:1;
      uint64_t REP_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SM_PDI_CTR;

};

#define ECAT0_SM7 (*(volatile struct ECAT0_SM7_tag *) 0x54010838)

struct USB0_EP0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:2;
      uint64_t reservedSpace0:13;
      uint64_t USBActEP:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKSts:1;
      uint64_t EPType:2;
      uint64_t reservedSpace2:1;
      uint64_t Stall:1;
      uint64_t TxFNum:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPDis:1;
      uint64_t EPEna:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPCTL0;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XferCompl:1;
      uint64_t EPDisbld:1;
      uint64_t AHBErr:1;
      uint64_t TimeOUT:1;
      uint64_t INTknTXFEmp:1;
      uint64_t reservedSpace0:1;
      uint64_t INEPNakEff:1;
      uint64_t TxFEmp:1;
      uint64_t reservedSpace1:1;
      uint64_t BNAIntr:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPINT0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XferSize:7;
      uint64_t reservedSpace0:12;
      uint64_t PktCnt:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPTSIZ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAAddr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPDMA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INEPTxFSpcAvail:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTXFSTS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMABufferAddr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIEPDMAB0;

  uint8_t res2[480];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPS:2;
      uint64_t reservedSpace0:13;
      uint64_t USBActEP:1;
      uint64_t reservedSpace1:1;
      uint64_t NAKSts:1;
      uint64_t EPType:2;
      uint64_t Snp:1;
      uint64_t Stall:1;
      uint64_t reservedSpace2:4;
      uint64_t CNAK:1;
      uint64_t SNAK:1;
      uint64_t reservedSpace3:2;
      uint64_t EPDis:1;
      uint64_t EPEna:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPCTL0;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XferCompl:1;
      uint64_t EPDisbld:1;
      uint64_t AHBErr:1;
      uint64_t SetUp:1;
      uint64_t OUTTknEPdis:1;
      uint64_t StsPhseRcvd:1;
      uint64_t Back2BackSETup:1;
      uint64_t reservedSpace0:2;
      uint64_t BNAIntr:1;
      uint64_t reservedSpace1:1;
      uint64_t PktDrpSts:1;
      uint64_t BbleErrIntrpt:1;
      uint64_t NAKIntrpt:1;
      uint64_t NYETIntrpt:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPINT0;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XferSize:7;
      uint64_t reservedSpace0:12;
      uint64_t PktCnt:2;
      uint64_t reservedSpace1:8;
      uint64_t SUPCnt:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPTSIZ0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAAddr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPDMA0;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMABufferAddr:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOEPDMAB0;

};

#define USB0_EP0 (*(volatile struct USB0_EP0_tag *) 0x50040900)

struct USIC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USIC0 (*(volatile struct USIC0_tag *) 0x40030008)

struct USIC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USIC1 (*(volatile struct USIC1_tag *) 0x48020008)

struct USIC2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USIC2 (*(volatile struct USIC2_tag *) 0x48024008)

struct CAN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:1;
      uint64_t EDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEP:10;
      uint64_t reservedSpace0:4;
      uint64_t DM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  uint8_t res1[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_7;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_7;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSIMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PANCMD:8;
      uint64_t BUSY:1;
      uint64_t RBUSY:1;
      uint64_t reservedSpace0:6;
      uint64_t PANAR1:8;
      uint64_t PANAR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PANCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSEL:4;
      uint64_t reservedSpace0:8;
      uint64_t MPSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MITR;

