iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define CAN (*(volatile struct CAN_tag *) 0x48014000)

struct CAN_NODE0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE0 (*(volatile struct CAN_NODE0_tag *) 0x48014200)

struct CAN_NODE1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE1 (*(volatile struct CAN_NODE1_tag *) 0x48014300)

struct CAN_NODE2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE2 (*(volatile struct CAN_NODE2_tag *) 0x48014400)

struct CAN_NODE3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

