iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define CAN_NODE3 (*(volatile struct CAN_NODE3_tag *) 0x48014500)

struct CAN_NODE4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE4 (*(volatile struct CAN_NODE4_tag *) 0x48014600)

struct CAN_NODE5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE5 (*(volatile struct CAN_NODE5_tag *) 0x48014700)

struct VADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:1;
      uint64_t EDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGS:2;
      uint64_t TGB:1;
      uint64_t TG_P:1;
      uint64_t reservedSpace0:20;
      uint64_t SUS:4;
      uint64_t SUS_P:1;
      uint64_t SUSSTA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCS;

  uint8_t res2[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVA:5;
      uint64_t reservedSpace0:2;
      uint64_t DCMSB:1;
      uint64_t DIVD:2;
      uint64_t reservedSpace1:5;
      uint64_t DIVWC:1;
      uint64_t DPCAL0:1;
      uint64_t DPCAL1:1;
      uint64_t DPCAL2:1;
      uint64_t DPCAL3:1;
      uint64_t reservedSpace2:11;
      uint64_t SUCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCFG;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCS:5;
      uint64_t reservedSpace0:3;
      uint64_t CMS:3;
      uint64_t reservedSpace1:5;
      uint64_t STCE:5;
      uint64_t reservedSpace2:3;
      uint64_t CME:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBICLASS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCS:5;
      uint64_t reservedSpace0:3;
      uint64_t CMS:3;
      uint64_t reservedSpace1:5;
      uint64_t STCE:5;
      uint64_t reservedSpace2:3;
      uint64_t CME:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBICLASS_1;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOUNDARY0:12;
      uint64_t reservedSpace0:4;
      uint64_t BOUNDARY1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBBOUND;

  uint8_t res5[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEVGLB:1;
      uint64_t reservedSpace0:7;
      uint64_t REVGLB:1;
      uint64_t reservedSpace1:7;
      uint64_t SEVGLBCLR:1;
      uint64_t reservedSpace2:7;
      uint64_t REVGLBCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBEFLAG;

  uint8_t res6[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEV0NP:4;
      uint64_t reservedSpace0:12;
      uint64_t REV0NP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBEVNP;

  uint8_t res7[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CDGR:4;
      uint64_t CDEN:1;
      uint64_t CDSEL:2;
      uint64_t reservedSpace1:4;
      uint64_t CDWC:1;
      uint64_t PDD:1;
      uint64_t reservedSpace2:6;
      uint64_t MDWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBTF;

  uint8_t res8[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_3;

  uint8_t res9[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_3;

  uint8_t res10[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCRESREG:4;
      uint64_t reservedSpace0:4;
      uint64_t XTSEL:4;
      uint64_t XTLVL:1;
      uint64_t XTMODE:2;
      uint64_t XTWC:1;
      uint64_t GTSEL:4;
      uint64_t GTLVL:1;
      uint64_t reservedSpace1:2;
      uint64_t GTWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENGT:2;
      uint64_t ENTR:1;
      uint64_t ENSI:1;
      uint64_t SCAN:1;
      uint64_t LDM:1;
      uint64_t reservedSpace0:1;
      uint64_t REQGT:1;
      uint64_t CLRPND:1;
      uint64_t LDEV:1;
      uint64_t reservedSpace1:6;
      uint64_t RPTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSMR;

  uint8_t res11[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DRCTR:4;
      uint64_t reservedSpace1:4;
      uint64_t WFR:1;
      uint64_t reservedSpace2:6;
      uint64_t SRGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRCR;

