iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res12[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t GNR:4;
      uint64_t CHNR:5;
      uint64_t EMUX:3;
      uint64_t CRS:2;
      uint64_t FCR:1;
      uint64_t VF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRES;

  uint8_t res13[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t GNR:4;
      uint64_t CHNR:5;
      uint64_t EMUX:3;
      uint64_t CRS:2;
      uint64_t FCR:1;
      uint64_t VF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRESD;

  uint8_t res14[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMUXGRP0:4;
      uint64_t EMUXGRP1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMUXSEL;

};

#define VADC (*(volatile struct VADC_tag *) 0x40004000)

struct DSD_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:1;
      uint64_t EDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SUS:4;
      uint64_t SUS_P:1;
      uint64_t SUSSTA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCS;

  uint8_t res2[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCFG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0RUN:1;
      uint64_t CH1RUN:1;
      uint64_t CH2RUN:1;
      uint64_t CH3RUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRC;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CGMOD:2;
      uint64_t BREV:1;
      uint64_t SIGPOL:1;
      uint64_t DIVCG:4;
      uint64_t reservedSpace0:7;
      uint64_t RUN:1;
      uint64_t BITCOUNT:5;
      uint64_t reservedSpace1:3;
      uint64_t STEPCOUNT:4;
      uint64_t STEPS:1;
      uint64_t STEPD:1;
      uint64_t SGNCG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGCFG;

  uint8_t res5[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESEV0:1;
      uint64_t RESEV1:1;
      uint64_t RESEV2:1;
      uint64_t RESEV3:1;
      uint64_t reservedSpace0:12;
      uint64_t ALEV0:1;
      uint64_t ALEV1:1;
      uint64_t ALEV2:1;
      uint64_t ALEV3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESEC0:1;
      uint64_t RESEC1:1;
      uint64_t RESEC2:1;
      uint64_t RESEC3:1;
      uint64_t reservedSpace0:12;
      uint64_t ALEC0:1;
      uint64_t ALEC1:1;
      uint64_t ALEC2:1;
      uint64_t ALEC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFLAGCLR;

};

#define DSD (*(volatile struct DSD_tag *) 0x40008000)

struct DSD_CH0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIVM:4;
      uint64_t reservedSpace1:3;
      uint64_t DWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSRC:4;
      uint64_t reservedSpace0:3;
      uint64_t DSWC:1;
      uint64_t ITRMODE:2;
      uint64_t TSTRMODE:2;
      uint64_t TRSEL:3;
      uint64_t TRWC:1;
      uint64_t CSRC:4;
      uint64_t STROBE:4;
      uint64_t reservedSpace1:7;
      uint64_t SCWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICFG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFMDF:8;
      uint64_t CFMC:2;
      uint64_t CFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t SRGM:2;
      uint64_t CFMSV:8;
      uint64_t CFMDCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFGC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFADF:8;
      uint64_t CFAC:2;
      uint64_t SRGA:2;
      uint64_t ESEL:2;
      uint64_t EGT:1;
      uint64_t reservedSpace0:9;
      uint64_t CFADCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFGA;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NVALCNT:6;
      uint64_t reservedSpace0:1;
      uint64_t INTEN:1;
      uint64_t REPCNT:4;
      uint64_t REPVAL:4;
      uint64_t NVALDIS:6;
      uint64_t reservedSpace1:1;
      uint64_t IWS:1;
      uint64_t NVALINT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWCTR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOUNDARYL:16;
      uint64_t BOUNDARYU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOUNDSEL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESM;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFFM;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESA;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t CFMDCNT:8;
      uint64_t NVALCNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSTMP;

  uint8_t res8[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDCOUNT:8;
      uint64_t SDCAP:8;
      uint64_t SDPOS:8;
      uint64_t SDNEG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGSYNC;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t SSRC:2;
      uint64_t reservedSpace1:9;
      uint64_t SDVAL:1;
      uint64_t reservedSpace2:14;
      uint64_t SGNCS:1;
      uint64_t SGND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECTCFG;

