iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define DSD_CH2 (*(volatile struct DSD_CH2_tag *) 0x40008300)

struct DSD_CH3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIVM:4;
      uint64_t reservedSpace1:3;
      uint64_t DWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSRC:4;
      uint64_t reservedSpace0:3;
      uint64_t DSWC:1;
      uint64_t ITRMODE:2;
      uint64_t TSTRMODE:2;
      uint64_t TRSEL:3;
      uint64_t TRWC:1;
      uint64_t CSRC:4;
      uint64_t STROBE:4;
      uint64_t reservedSpace1:7;
      uint64_t SCWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DICFG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFMDF:8;
      uint64_t CFMC:2;
      uint64_t CFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t SRGM:2;
      uint64_t CFMSV:8;
      uint64_t CFMDCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFGC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFADF:8;
      uint64_t CFAC:2;
      uint64_t SRGA:2;
      uint64_t ESEL:2;
      uint64_t EGT:1;
      uint64_t reservedSpace0:9;
      uint64_t CFADCNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFGA;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NVALCNT:6;
      uint64_t reservedSpace0:1;
      uint64_t INTEN:1;
      uint64_t REPCNT:4;
      uint64_t REPVAL:4;
      uint64_t NVALDIS:6;
      uint64_t reservedSpace1:1;
      uint64_t IWS:1;
      uint64_t NVALINT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IWCTR;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOUNDARYL:16;
      uint64_t BOUNDARYU:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOUNDSEL;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESM;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFFM;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESA;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t CFMDCNT:8;
      uint64_t NVALCNT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSTMP;

  uint8_t res8[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDCOUNT:8;
      uint64_t SDCAP:8;
      uint64_t SDPOS:8;
      uint64_t SDNEG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGSYNC;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFEN:1;
      uint64_t reservedSpace0:3;
      uint64_t SSRC:2;
      uint64_t reservedSpace1:9;
      uint64_t SDVAL:1;
      uint64_t reservedSpace2:14;
      uint64_t SGNCS:1;
      uint64_t SGND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECTCFG;

};

#define DSD_CH3 (*(volatile struct DSD_CH3_tag *) 0x40008400)

struct DAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:20;
      uint64_t MODE:3;
      uint64_t SIGN:1;
      uint64_t FIFOIND:2;
      uint64_t FIFOEMP:1;
      uint64_t FIFOFUL:1;
      uint64_t NEGATE:1;
      uint64_t SIGNEN:1;
      uint64_t SREN:1;
      uint64_t RUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCALE:3;
      uint64_t MULDIV:1;
      uint64_t OFFS:8;
      uint64_t TRIGSEL:3;
      uint64_t DATMOD:1;
      uint64_t SWTRIG:1;
      uint64_t TRIGMOD:2;
      uint64_t ANACFG:5;
      uint64_t ANAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t REFCFGL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:20;
      uint64_t MODE:3;
      uint64_t SIGN:1;
      uint64_t FIFOIND:2;
      uint64_t FIFOEMP:1;
      uint64_t FIFOFUL:1;
      uint64_t NEGATE:1;
      uint64_t SIGNEN:1;
      uint64_t SREN:1;
      uint64_t RUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCALE:3;
      uint64_t MULDIV:1;
      uint64_t OFFS:8;
      uint64_t TRIGSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t SWTRIG:1;
      uint64_t TRIGMOD:2;
      uint64_t ANACFG:5;
      uint64_t ANAEN:1;
      uint64_t reservedSpace1:3;
      uint64_t REFCFGH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:12;
      uint64_t reservedSpace0:4;
      uint64_t DATA1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC01DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAT0:5;
      uint64_t PAT1:5;
      uint64_t PAT2:5;
      uint64_t PAT3:5;
      uint64_t PAT4:5;
      uint64_t PAT5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0PATL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAT6:5;
      uint64_t PAT7:5;
      uint64_t PAT8:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC0PATH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAT0:5;
      uint64_t PAT1:5;
      uint64_t PAT2:5;
      uint64_t PAT3:5;
      uint64_t PAT4:5;
      uint64_t PAT5:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1PATL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAT6:5;
      uint64_t PAT7:5;
      uint64_t PAT8:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC1PATH;

