iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define CCU41 (*(volatile struct CCU41_tag *) 0x40010000)

struct CCU42_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRBC:3;
      uint64_t reservedSpace0:1;
      uint64_t PCIS:2;
      uint64_t reservedSpace1:2;
      uint64_t SUSCFG:2;
      uint64_t MSE0:1;
      uint64_t MSE1:1;
      uint64_t MSE2:1;
      uint64_t MSE3:1;
      uint64_t MSDE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0I:1;
      uint64_t S1I:1;
      uint64_t S2I:1;
      uint64_t S3I:1;
      uint64_t reservedSpace0:4;
      uint64_t PRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS0I:1;
      uint64_t SS1I:1;
      uint64_t SS2I:1;
      uint64_t SS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t CPRB:1;
      uint64_t PSIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0I:1;
      uint64_t CS1I:1;
      uint64_t CS2I:1;
      uint64_t CS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t SPRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SE:1;
      uint64_t S0DSE:1;
      uint64_t S0PSE:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SE:1;
      uint64_t S1DSE:1;
      uint64_t S1PSE:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SE:1;
      uint64_t S2DSE:1;
      uint64_t S2PSE:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SE:1;
      uint64_t S3DSE:1;
      uint64_t S3PSE:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STS:1;
      uint64_t S1STS:1;
      uint64_t S2STS:1;
      uint64_t S3STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SC:1;
      uint64_t S0DSC:1;
      uint64_t S0PSC:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SC:1;
      uint64_t S1DSC:1;
      uint64_t S1PSC:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SC:1;
      uint64_t S2DSC:1;
      uint64_t S2PSC:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SC:1;
      uint64_t S3DSC:1;
      uint64_t S3PSC:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STC:1;
      uint64_t S1STC:1;
      uint64_t S2STC:1;
      uint64_t S3STC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SS:1;
      uint64_t S0DSS:1;
      uint64_t S0PSS:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SS:1;
      uint64_t S1DSS:1;
      uint64_t S1PSS:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SS:1;
      uint64_t S2DSS:1;
      uint64_t S2PSS:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SS:1;
      uint64_t S3DSS:1;
      uint64_t S3PSS:1;
      uint64_t reservedSpace3:1;
      uint64_t CC40ST:1;
      uint64_t CC41ST:1;
      uint64_t CC42ST:1;
      uint64_t CC43ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCST;

  uint8_t res0[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

};

#define CCU42 (*(volatile struct CCU42_tag *) 0x40014000)

struct CCU43_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRBC:3;
      uint64_t reservedSpace0:1;
      uint64_t PCIS:2;
      uint64_t reservedSpace1:2;
      uint64_t SUSCFG:2;
      uint64_t MSE0:1;
      uint64_t MSE1:1;
      uint64_t MSE2:1;
      uint64_t MSE3:1;
      uint64_t MSDE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0I:1;
      uint64_t S1I:1;
      uint64_t S2I:1;
      uint64_t S3I:1;
      uint64_t reservedSpace0:4;
      uint64_t PRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS0I:1;
      uint64_t SS1I:1;
      uint64_t SS2I:1;
      uint64_t SS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t CPRB:1;
      uint64_t PSIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0I:1;
      uint64_t CS1I:1;
      uint64_t CS2I:1;
      uint64_t CS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t SPRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SE:1;
      uint64_t S0DSE:1;
      uint64_t S0PSE:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SE:1;
      uint64_t S1DSE:1;
      uint64_t S1PSE:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SE:1;
      uint64_t S2DSE:1;
      uint64_t S2PSE:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SE:1;
      uint64_t S3DSE:1;
      uint64_t S3PSE:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STS:1;
      uint64_t S1STS:1;
      uint64_t S2STS:1;
      uint64_t S3STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SC:1;
      uint64_t S0DSC:1;
      uint64_t S0PSC:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SC:1;
      uint64_t S1DSC:1;
      uint64_t S1PSC:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SC:1;
      uint64_t S2DSC:1;
      uint64_t S2PSC:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SC:1;
      uint64_t S3DSC:1;
      uint64_t S3PSC:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STC:1;
      uint64_t S1STC:1;
      uint64_t S2STC:1;
      uint64_t S3STC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SS:1;
      uint64_t S0DSS:1;
      uint64_t S0PSS:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SS:1;
      uint64_t S1DSS:1;
      uint64_t S1PSS:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SS:1;
      uint64_t S2DSS:1;
      uint64_t S2PSS:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SS:1;
      uint64_t S3DSS:1;
      uint64_t S3PSS:1;
      uint64_t reservedSpace3:1;
      uint64_t CC40ST:1;
      uint64_t CC41ST:1;
      uint64_t CC42ST:1;
      uint64_t CC43ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCST;

  uint8_t res0[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

