iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
      uint64_t LCV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
      uint64_t LCV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD1;

};

#define CCU42_CC42 (*(volatile struct CCU42_CC42_tag *) 0x40014300)

struct CCU42_CC43_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV0IS:4;
      uint64_t EV1IS:4;
      uint64_t EV2IS:4;
      uint64_t reservedSpace0:4;
      uint64_t EV0EM:2;
      uint64_t EV1EM:2;
      uint64_t EV2EM:2;
      uint64_t EV0LM:1;
      uint64_t EV1LM:1;
      uint64_t EV2LM:1;
      uint64_t LPF0M:2;
      uint64_t LPF1M:2;
      uint64_t LPF2M:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STRTS:2;
      uint64_t ENDS:2;
      uint64_t CAP0S:2;
      uint64_t CAP1S:2;
      uint64_t GATES:2;
      uint64_t UDS:2;
      uint64_t LDS:2;
      uint64_t CNTS:2;
      uint64_t OFS:1;
      uint64_t TS:1;
      uint64_t MOS:2;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRB:1;
      uint64_t CDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRBS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRBC:1;
      uint64_t TCC:1;
      uint64_t DITC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCM:1;
      uint64_t TSSM:1;
      uint64_t CLST:1;
      uint64_t CMOD:1;
      uint64_t ECM:1;
      uint64_t CAPC:2;
      uint64_t reservedSpace0:1;
      uint64_t ENDM:2;
      uint64_t STRM:1;
      uint64_t SCE:1;
      uint64_t CCS:1;
      uint64_t DITHE:2;
      uint64_t DIM:1;
      uint64_t FPE:1;
      uint64_t TRAPE:1;
      uint64_t reservedSpace1:3;
      uint64_t TRPSE:1;
      uint64_t TRPSW:1;
      uint64_t EMS:1;
      uint64_t EMT:1;
      uint64_t MCME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCV:4;
      uint64_t reservedSpace0:4;
      uint64_t DCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCVS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DITS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCMP:4;
      uint64_t reservedSpace0:4;
      uint64_t PVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCMP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FPCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTV:16;
      uint64_t FPCV:4;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C0V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTV:16;
      uint64_t FPCV:4;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C1V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTV:16;
      uint64_t FPCV:4;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C2V;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTV:16;
      uint64_t FPCV:4;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) C3V;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMUS:1;
      uint64_t OMDS:1;
      uint64_t CMUS:1;
      uint64_t CMDS:1;
      uint64_t reservedSpace0:4;
      uint64_t E0AS:1;
      uint64_t E1AS:1;
      uint64_t E2AS:1;
      uint64_t TRPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PME:1;
      uint64_t OME:1;
      uint64_t CMUE:1;
      uint64_t CMDE:1;
      uint64_t reservedSpace0:4;
      uint64_t E0AE:1;
      uint64_t E1AE:1;
      uint64_t E2AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POSR:2;
      uint64_t CMSR:2;
      uint64_t reservedSpace0:4;
      uint64_t E0SR:2;
      uint64_t E1SR:2;
      uint64_t E2SR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPM:1;
      uint64_t SOM:1;
      uint64_t SCMU:1;
      uint64_t SCMD:1;
      uint64_t reservedSpace0:4;
      uint64_t SE0A:1;
      uint64_t SE1A:1;
      uint64_t SE2A:1;
      uint64_t STRPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPM:1;
      uint64_t ROM:1;
      uint64_t RCMU:1;
      uint64_t RCMD:1;
      uint64_t reservedSpace0:4;
      uint64_t RE0A:1;
      uint64_t RE1A:1;
      uint64_t RE2A:1;
      uint64_t RTRPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWR;

