iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
      uint64_t LCV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
      uint64_t LCV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD1;

};

#define CCU43_CC43 (*(volatile struct CCU43_CC43_tag *) 0x48004400)

struct CCU80_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRBC:3;
      uint64_t reservedSpace0:1;
      uint64_t PCIS:2;
      uint64_t reservedSpace1:2;
      uint64_t SUSCFG:2;
      uint64_t MSE0:1;
      uint64_t MSE1:1;
      uint64_t MSE2:1;
      uint64_t MSE3:1;
      uint64_t MSDE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0I:1;
      uint64_t S1I:1;
      uint64_t S2I:1;
      uint64_t S3I:1;
      uint64_t reservedSpace0:4;
      uint64_t PRB:1;
      uint64_t reservedSpace1:1;
      uint64_t PCRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS0I:1;
      uint64_t SS1I:1;
      uint64_t SS2I:1;
      uint64_t SS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t CPRB:1;
      uint64_t PSIC:1;
      uint64_t CPCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0I:1;
      uint64_t CS1I:1;
      uint64_t CS2I:1;
      uint64_t CS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t SPRB:1;
      uint64_t reservedSpace1:1;
      uint64_t SPCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SE:1;
      uint64_t S0DSE:1;
      uint64_t S0PSE:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SE:1;
      uint64_t S1DSE:1;
      uint64_t S1PSE:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SE:1;
      uint64_t S2DSE:1;
      uint64_t S2PSE:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SE:1;
      uint64_t S3DSE:1;
      uint64_t S3PSE:1;
      uint64_t reservedSpace3:1;
      uint64_t S0ST1S:1;
      uint64_t S1ST1S:1;
      uint64_t S2ST1S:1;
      uint64_t S3ST1S:1;
      uint64_t S0ST2S:1;
      uint64_t S1ST2S:1;
      uint64_t S2ST2S:1;
      uint64_t S3ST2S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SC:1;
      uint64_t S0DSC:1;
      uint64_t S0PSC:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SC:1;
      uint64_t S1DSC:1;
      uint64_t S1PSC:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SC:1;
      uint64_t S2DSC:1;
      uint64_t S2PSC:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SC:1;
      uint64_t S3DSC:1;
      uint64_t S3PSC:1;
      uint64_t reservedSpace3:1;
      uint64_t S0ST1C:1;
      uint64_t S1ST1C:1;
      uint64_t S2ST1C:1;
      uint64_t S3ST1C:1;
      uint64_t S0ST2C:1;
      uint64_t S1ST2C:1;
      uint64_t S2ST2C:1;
      uint64_t S3ST2C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SS:1;
      uint64_t S0DSS:1;
      uint64_t S0PSS:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SS:1;
      uint64_t S1DSS:1;
      uint64_t S1PSS:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SS:1;
      uint64_t S2DSS:1;
      uint64_t S2PSS:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SS:1;
      uint64_t S3DSS:1;
      uint64_t S3PSS:1;
      uint64_t reservedSpace3:1;
      uint64_t CC80ST1:1;
      uint64_t CC81ST1:1;
      uint64_t CC82ST1:1;
      uint64_t CC83ST1:1;
      uint64_t CC80ST2:1;
      uint64_t CC81ST2:1;
      uint64_t CC82ST2:1;
      uint64_t CC83ST2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PASE:1;
      uint64_t PACS:2;
      uint64_t PISEL:2;
      uint64_t PCDS:2;
      uint64_t PCTS:1;
      uint64_t reservedSpace0:7;
      uint64_t PCST:1;
      uint64_t PCSEL0:4;
      uint64_t PCSEL1:4;
      uint64_t PCSEL2:4;
      uint64_t PCSEL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPCHK;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

};

#define CCU80 (*(volatile struct CCU80_tag *) 0x40020000)

struct CCU81_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRBC:3;
      uint64_t reservedSpace0:1;
      uint64_t PCIS:2;
      uint64_t reservedSpace1:2;
      uint64_t SUSCFG:2;
      uint64_t MSE0:1;
      uint64_t MSE1:1;
      uint64_t MSE2:1;
      uint64_t MSE3:1;
      uint64_t MSDE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0I:1;
      uint64_t S1I:1;
      uint64_t S2I:1;
      uint64_t S3I:1;
      uint64_t reservedSpace0:4;
      uint64_t PRB:1;
      uint64_t reservedSpace1:1;
      uint64_t PCRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS0I:1;
      uint64_t SS1I:1;
      uint64_t SS2I:1;
      uint64_t SS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t CPRB:1;
      uint64_t PSIC:1;
      uint64_t CPCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0I:1;
      uint64_t CS1I:1;
      uint64_t CS2I:1;
      uint64_t CS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t SPRB:1;
      uint64_t reservedSpace1:1;
      uint64_t SPCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SE:1;
      uint64_t S0DSE:1;
      uint64_t S0PSE:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SE:1;
      uint64_t S1DSE:1;
      uint64_t S1PSE:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SE:1;
      uint64_t S2DSE:1;
      uint64_t S2PSE:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SE:1;
      uint64_t S3DSE:1;
      uint64_t S3PSE:1;
      uint64_t reservedSpace3:1;
      uint64_t S0ST1S:1;
      uint64_t S1ST1S:1;
      uint64_t S2ST1S:1;
      uint64_t S3ST1S:1;
      uint64_t S0ST2S:1;
      uint64_t S1ST2S:1;
      uint64_t S2ST2S:1;
      uint64_t S3ST2S:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SC:1;
      uint64_t S0DSC:1;
      uint64_t S0PSC:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SC:1;
      uint64_t S1DSC:1;
      uint64_t S1PSC:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SC:1;
      uint64_t S2DSC:1;
      uint64_t S2PSC:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SC:1;
      uint64_t S3DSC:1;
      uint64_t S3PSC:1;
      uint64_t reservedSpace3:1;
      uint64_t S0ST1C:1;
      uint64_t S1ST1C:1;
      uint64_t S2ST1C:1;
      uint64_t S3ST1C:1;
      uint64_t S0ST2C:1;
      uint64_t S1ST2C:1;
      uint64_t S2ST2C:1;
      uint64_t S3ST2C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SS:1;
      uint64_t S0DSS:1;
      uint64_t S0PSS:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SS:1;
      uint64_t S1DSS:1;
      uint64_t S1PSS:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SS:1;
      uint64_t S2DSS:1;
      uint64_t S2PSS:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SS:1;
      uint64_t S3DSS:1;
      uint64_t S3PSS:1;
      uint64_t reservedSpace3:1;
      uint64_t CC80ST1:1;
      uint64_t CC81ST1:1;
      uint64_t CC82ST1:1;
      uint64_t CC83ST1:1;
      uint64_t CC80ST2:1;
      uint64_t CC81ST2:1;
      uint64_t CC82ST2:1;
      uint64_t CC83ST2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PASE:1;
      uint64_t PACS:2;
      uint64_t PISEL:2;
      uint64_t PCDS:2;
      uint64_t PCTS:1;
      uint64_t reservedSpace0:7;
      uint64_t PCST:1;
      uint64_t PCSEL0:4;
      uint64_t PCSEL1:4;
      uint64_t PCSEL2:4;
      uint64_t PCSEL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPCHK;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPV:16;
      uint64_t FPCV:4;
      uint64_t SPTR:2;
      uint64_t VPTR:2;
      uint64_t FFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECRD;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

