iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
};

#define CCU81_CC83 (*(volatile struct CCU81_CC83_tag *) 0x40024400)

struct POSIF0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:2;
      uint64_t QDCM:1;
      uint64_t reservedSpace0:1;
      uint64_t HIDG:1;
      uint64_t MCUE:1;
      uint64_t reservedSpace1:2;
      uint64_t INSEL0:2;
      uint64_t INSEL1:2;
      uint64_t INSEL2:2;
      uint64_t reservedSpace2:2;
      uint64_t DSEL:1;
      uint64_t SPES:1;
      uint64_t MSETS:3;
      uint64_t MSES:1;
      uint64_t MSYNS:2;
      uint64_t EWIS:2;
      uint64_t EWIE:1;
      uint64_t EWIL:1;
      uint64_t LPC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSUS:2;
      uint64_t MSUS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRB:1;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUN;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCP:3;
      uint64_t HEP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HALP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCPS:3;
      uint64_t HEPS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HALPS;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMPS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCSM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPS:1;
      uint64_t STHR:1;
      uint64_t STMR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPC:1;
      uint64_t MPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMF;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PALS:1;
      uint64_t PBLS:1;
      uint64_t PHS:1;
      uint64_t reservedSpace0:1;
      uint64_t ICM:2;
      uint64_t reservedSpace1:2;
      uint64_t DVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDC;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHES:1;
      uint64_t WHES:1;
      uint64_t HIES:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTS:1;
      uint64_t reservedSpace1:3;
      uint64_t INDXS:1;
      uint64_t ERRS:1;
      uint64_t CNTS:1;
      uint64_t DIRS:1;
      uint64_t PCLKS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECHE:1;
      uint64_t EWHE:1;
      uint64_t EHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EMST:1;
      uint64_t reservedSpace1:3;
      uint64_t EINDX:1;
      uint64_t EERR:1;
      uint64_t ECNT:1;
      uint64_t EDIR:1;
      uint64_t EPCLK:1;
      uint64_t reservedSpace2:3;
      uint64_t CHESEL:1;
      uint64_t WHESEL:1;
      uint64_t HIESEL:1;
      uint64_t reservedSpace3:1;
      uint64_t MSTSEL:1;
      uint64_t reservedSpace4:3;
      uint64_t INDSEL:1;
      uint64_t ERRSEL:1;
      uint64_t CNTSEL:1;
      uint64_t DIRSEL:1;
      uint64_t PCLSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCHE:1;
      uint64_t SWHE:1;
      uint64_t SHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t SMST:1;
      uint64_t reservedSpace1:3;
      uint64_t SINDX:1;
      uint64_t SERR:1;
      uint64_t SCNT:1;
      uint64_t SDIR:1;
      uint64_t SPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCHE:1;
      uint64_t RWHE:1;
      uint64_t RHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RMST:1;
      uint64_t reservedSpace1:3;
      uint64_t RINDX:1;
      uint64_t RERR:1;
      uint64_t RCNT:1;
      uint64_t RDIR:1;
      uint64_t RPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RPFLG;

  uint8_t res5[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QCSV:2;
      uint64_t QPSV:2;
      uint64_t IVAL:1;
      uint64_t HSP:3;
      uint64_t LPP0:6;
      uint64_t reservedSpace0:2;
      uint64_t LPP1:6;
      uint64_t LPP2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDBG;

};

#define POSIF0 (*(volatile struct POSIF0_tag *) 0x40028000)

struct POSIF1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSEL:2;
      uint64_t QDCM:1;
      uint64_t reservedSpace0:1;
      uint64_t HIDG:1;
      uint64_t MCUE:1;
      uint64_t reservedSpace1:2;
      uint64_t INSEL0:2;
      uint64_t INSEL1:2;
      uint64_t INSEL2:2;
      uint64_t reservedSpace2:2;
      uint64_t DSEL:1;
      uint64_t SPES:1;
      uint64_t MSETS:3;
      uint64_t MSES:1;
      uint64_t MSYNS:2;
      uint64_t EWIS:2;
      uint64_t EWIE:1;
      uint64_t EWIL:1;
      uint64_t LPC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSUS:2;
      uint64_t MSUS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUNS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRB:1;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRUN;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCP:3;
      uint64_t HEP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HALP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCPS:3;
      uint64_t HEPS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HALPS;

