iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC4800/targetInit/XMC4800_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMPS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCSM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPS:1;
      uint64_t STHR:1;
      uint64_t STMR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPC:1;
      uint64_t MPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMF;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PALS:1;
      uint64_t PBLS:1;
      uint64_t PHS:1;
      uint64_t reservedSpace0:1;
      uint64_t ICM:2;
      uint64_t reservedSpace1:2;
      uint64_t DVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDC;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHES:1;
      uint64_t WHES:1;
      uint64_t HIES:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTS:1;
      uint64_t reservedSpace1:3;
      uint64_t INDXS:1;
      uint64_t ERRS:1;
      uint64_t CNTS:1;
      uint64_t DIRS:1;
      uint64_t PCLKS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECHE:1;
      uint64_t EWHE:1;
      uint64_t EHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EMST:1;
      uint64_t reservedSpace1:3;
      uint64_t EINDX:1;
      uint64_t EERR:1;
      uint64_t ECNT:1;
      uint64_t EDIR:1;
      uint64_t EPCLK:1;
      uint64_t reservedSpace2:3;
      uint64_t CHESEL:1;
      uint64_t WHESEL:1;
      uint64_t HIESEL:1;
      uint64_t reservedSpace3:1;
      uint64_t MSTSEL:1;
      uint64_t reservedSpace4:3;
      uint64_t INDSEL:1;
      uint64_t ERRSEL:1;
      uint64_t CNTSEL:1;
      uint64_t DIRSEL:1;
      uint64_t PCLSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCHE:1;
      uint64_t SWHE:1;
      uint64_t SHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t SMST:1;
      uint64_t reservedSpace1:3;
      uint64_t SINDX:1;
      uint64_t SERR:1;
      uint64_t SCNT:1;
      uint64_t SDIR:1;
      uint64_t SPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCHE:1;
      uint64_t RWHE:1;
      uint64_t RHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RMST:1;
      uint64_t reservedSpace1:3;
      uint64_t RINDX:1;
      uint64_t RERR:1;
      uint64_t RCNT:1;
      uint64_t RDIR:1;
      uint64_t RPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RPFLG;

  uint8_t res5[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QCSV:2;
      uint64_t QPSV:2;
      uint64_t IVAL:1;
      uint64_t HSP:3;
      uint64_t LPP0:6;
      uint64_t reservedSpace0:2;
      uint64_t LPP1:6;
      uint64_t LPP2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDBG;

};

#define POSIF1 (*(volatile struct POSIF1_tag *) 0x4002c000)

struct PORT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0:1;
      uint64_t P1:1;
      uint64_t P2:1;
      uint64_t P3:1;
      uint64_t P4:1;
      uint64_t P5:1;
      uint64_t P6:1;
      uint64_t P7:1;
      uint64_t P8:1;
      uint64_t P9:1;
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0:1;
      uint64_t PS1:1;
      uint64_t PS2:1;
      uint64_t PS3:1;
      uint64_t PS4:1;
      uint64_t PS5:1;
      uint64_t PS6:1;
      uint64_t PS7:1;
      uint64_t PS8:1;
      uint64_t PS9:1;
      uint64_t PS10:1;
      uint64_t PS11:1;
      uint64_t PS12:1;
      uint64_t PS13:1;
      uint64_t PS14:1;
      uint64_t PS15:1;
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
      uint64_t PR5:1;
      uint64_t PR6:1;
      uint64_t PR7:1;
      uint64_t PR8:1;
      uint64_t PR9:1;
      uint64_t PR10:1;
      uint64_t PR11:1;
      uint64_t PR12:1;
      uint64_t PR13:1;
      uint64_t PR14:1;
      uint64_t PR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OMR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PC0:5;
      uint64_t reservedSpace1:3;
      uint64_t PC1:5;
      uint64_t reservedSpace2:3;
      uint64_t PC2:5;
      uint64_t reservedSpace3:3;
      uint64_t PC3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PC4:5;
      uint64_t reservedSpace1:3;
      uint64_t PC5:5;
      uint64_t reservedSpace2:3;
      uint64_t PC6:5;
      uint64_t reservedSpace3:3;
      uint64_t PC7:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PC8:5;
      uint64_t reservedSpace1:3;
      uint64_t PC9:5;
      uint64_t reservedSpace2:3;
      uint64_t PC10:5;
      uint64_t reservedSpace3:3;
      uint64_t PC11:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PC12:5;
      uint64_t reservedSpace1:3;
      uint64_t PC13:5;
      uint64_t reservedSpace2:3;
      uint64_t PC14:5;
      uint64_t reservedSpace3:3;
      uint64_t PC15:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR12;

